{
	"version": "https://jsonfeed.org/version/1",
	"title": null,
	"home_page_url": "http://localhost:4000/",
	"feed_url": "http://localhost:4000/feed.json",
	"items": [
		
		{
			"id": "11830",
      
			"content_html": "<p>I feel like I need to do a blog series on \"getting started\" with Ethereum development.  The tech changes so frequently and is super scattered around the web.  This makes for such a steep learning curve. I would love to contribute my findings to the community. Would anyone read?</p>\n",
			"date_published": "2018-04-16T21:17:10-06:00",
			"url": "http://localhost:4000/11830.html"
		},
		
		{
			"id": "48295",
      
			"content_html": "<p>Our team has launched our first DApp on the Ethereum test net for a client.  Building a solidity / blockchain app has been more fun that anything I have worked on since the early days of iOS dev. I recommend checking out <a href=\"http://cryptozombies.io\">Crypto Zombies</a> if you are interested in learning solidity.</p>\n",
			"date_published": "2018-04-16T07:24:55-06:00",
			"url": "http://localhost:4000/48295.html"
		},
		
		{
			"id": "trying-something-new",
      
			"title": "Trying Something New",
			
			"content_html": "<p><strong>tl;dr</strong>: <a href=\"micro.blog\">http://micro.blog</a> is pretty cool.</p>\n\n<p>I have recently been thinking about my process of blogging / tweeting / facebooking / etc.. and have realized that I’m burnt out on all three. I LOVE to write. I started one of the <a href=\"https://web.archive.org/web/20090202061853/http://icodeblog.com\">first successful iOS Blogs</a>,  published numerous (software development books)[http://manning.com/trebitowski], and have been blogging since 2008.  Here are a bit of thoughts about the various platforms and ultimately my solution.</p>\n\n<h2 id=\"twitter\">twitter</h2>\n\n<p>Having over 4,000 followers on <a href=\"http://twitter.com/brandontreb\">Twitter</a> I used to find tremendous value in the platform.  There was a time when I would ask a programming question and get 20+ responses within 10 minutes.  I’m not sure if legit people have stopped following me or have stopped using the platform, but I am no longer getting any engagement. I probably have like 20 followers and 3,800 spam bots at this point.</p>\n\n<h2 id=\"blogging\">blogging</h2>\n\n<p>To me, blogging has always had to be long-form.  Maybe it’s just my wannabe Tim Ferris mindset, but this has held me back from writing for quite a long time. I would wait until I had a long (usually 1K words +) post before writing anything.  So, it other words, perpetual writers block.</p>\n\n<h2 id=\"facebook\">facebook</h2>\n\n<p>Don’t even get me started. I jumped on the <strong>#deleteFacebook</strong> bandwagon months ago.</p>\n\n<p><a href=\"https://deletefacebook.com/\">#deleteFacebook</a></p>\n\n<h2 id=\"microblog\">micro.blog</h2>\n\n<p>Recently, I discovered <a href=\"http://manton.org\">Manton Reece’s</a> new platform called <a href=\"micro.blog\">http://micro.blog</a>.  I guess the platform isn’t necessarily <em>new</em> as he launched in 2015, but after using it, it still feels like it’s in the new/exciting phase.</p>\n\n<p>Manton describes perfectly why he created the platform <a href=\"http://help.micro.blog/2015/why-i-created-this/\">here</a> and this captures my thoughts exactly on the content-creation ecosystem.</p>\n\n<p>Here are some things that I’m super excited about the micro.blog platform:</p>\n\n<ul>\n  <li>You post to <strong>your own</strong> site, keeping all the content controlled by <strong>you</strong></li>\n  <li>You can also pay $5 monthly for a hosted blog.  This means their business is built on an actual product rather than advertising revenue.</li>\n  <li>It’s built on RSS. I have always been a huge RSS fan and am glad to see a resurgence.</li>\n  <li>It’s super NERDY. While I think micro.blog is an incredible platform, I still think it’s for geeks (in the same way crypto is).  But I love this about it since most of the people on there are devs/geeks.</li>\n  <li>It’s incredibly social. The platform really encourages conversation.</li>\n  <li>No follower count.  This is arguably the best part. No one (including yourself) can see your follower count.  This allows you the feeling to just create and not worry about the vanity of the whole thing.</li>\n</ul>\n\n<p>I still plan on using Twitter to some extent, but my primary source of content publishing will/should be <strong>this blog</strong>.  It will  become a mix of my long-form posts and my “tweet-sized” snarky comments.</p>\n\n<p>If this sounds even slightly interesting to you, def check it out and follow me on <a href=\"http://eepurl.com/bnryI5\">here</a> or on <a href=\"micro.blog\">http://microblog.com/brandontreb</a>.</p>\n\n<p>Cheers!</p>\n",
			"date_published": "2018-04-15T17:00:00-06:00",
			"url": "http://localhost:4000/trying-something-new"
		},
		
		{
			"id": "tips-for-sales-calls",
      
			"title": "How Creating A Call Flow Can Help Your Software Sales Calls",
			
			"content_html": "<p>In 2008, I was still in college. I had just landed my first job with a small consultancy as their first iOS developer replacing their outsourced Ukrainian team. Within my first week on the job, the CEO asked me to jump on a sales call as the technical lead.  This absolutely terrified me.  I remember doing things like ensuring that I had a full glass of water so my throat wouldn’t get so dry (it still did).  I also stumbled over my words, almost costing the team many sales.  Eventually, I learned.</p>\n\n<p>Since that day, I have taken hundreds of software sales calls.  Each time trying to improve my process by testing out what works and what doesn’t.  Now that I run my own company, I have found that one of the most beneficial things that I have done is implemented a standard call flow.</p>\n\n<p>There is a reason that call centers require their employees to memorize call flows.  When you have a call flow in place, it does a few things.</p>\n\n<h2 id=\"1-it-allows-you-to-practice-and-refine-your-pitch-over-and-over-again\">1. It allows you to practice and refine your pitch over and over again.</h2>\n\n<p>Practice makes perfect.  Definitely cliche, but it makes a lot of sense here. As you give your pitch over and over again, you will start to pair it down to something that works for you and your team.</p>\n\n<h2 id=\"2-it-builds-confidence\">2. It builds confidence</h2>\n\n<p>Many people are nervous speaking to strangers. Software developers are no exception to this.  As I mentioned above, I was terrified on my first few sales calls.  This had a lot to do with the fact that I was ‘shooting from the hip’ and just trying to make things up as I went along.</p>\n\n<p>Once I finally got a script in place, I was able to lean on it during future calls.  This gave me the confidence that I was gathering all of the right information and representing myself in the best way possible.</p>\n\n<p>Now when someone says “Could I see an example of your work?”, I can quickly shoot them a link or list rather than nervously trying to get the words out “well…uh…I made an app about catz, and I’ll find the link and…uhhh… send it to you later…”.</p>\n\n<h2 id=\"3-its-so-easy-a-sales-guy-can-do-it\">3. It’s so easy a ‘sales guy’ can do it</h2>\n\n<p>This is the part that I’m starting to experiment with.  I want my pitch for my company to be so tight, that I could give it to any ‘sales guy’ to deliver and him represent Pixegon in much the same way I would.  I have already done this with some of my engineers as I don’t always have time to make every single sales call and it has proven to be a huge success.</p>\n\n<h2 id=\"4-it-removes-emotion\">4. It removes emotion</h2>\n\n<p>This is a big one. When we are nervous, we tend to say dumb things.  I remember a few times on sales calls when I was nervous (often because I really wanted/needed the contract), that I would seriously compromise on my rate just because the client suggested it.  Had I had a call flow in font of me, I would have been better prepared to field such a request.</p>\n\n<p>I now replace emotion with process and it usually ends up better for both parties.</p>\n\n<h3 id=\"sample-flow\">Sample Flow</h3>\n\n<p>Here is a rough outline of my sample call flow:</p>\n\n<ul>\n  <li>Client Introduction - Ask the client about their background</li>\n  <li>How did you find us? Good to find out what advertising channels are working</li>\n  <li>Give my background - This is to establish credentials so they trust me</li>\n  <li>Ask the client to give a 10,000’ overview of the project - Be careful here, they love to get in the weeds</li>\n  <li>The 3 most important questions\n    <ol>\n      <li>What’s your budget? This will let you know right away if you want to continue much further based on your budget tolerance and rough guess on how much the above will cost.</li>\n      <li>What’s your timeline? Every single client will say ASAP.  But really this is to find out if there are any conferences, holidays, etc… that are hard deadlines for them</li>\n      <li>How are you funding this project? Self, Company, VC, Family, Startup, etc… This will also help you assess risk.</li>\n    </ol>\n  </li>\n  <li>Ask more detailed questions about the project (If timeline / budget are somewhat ok).  Determine things like backend requirements, UI/UX, Staff aug vs full solution, etc…</li>\n  <li>Don’t give them a $$$ estimate. They will usually ask you and it will usually cost you in the end if you give them a number here.</li>\n  <li>If all goes well, ask them to send over any assets/wires/requirements and tell them you will follow up with a rough scope and estimate. Again, <strong>don’t estimate on this call</strong></li>\n  <li>Thank them for their time and let them know you will be in touch.</li>\n</ul>\n\n<p>This is definitely a good starting point.  Sometimes I will copy and paste these flows into a new document and tailor them based on the client that I am about to speak to.</p>\n\n<h2 id=\"conclusion\">Conclusion</h2>\n\n<p>Sales is something that I am constantly working on and refining.  I hope to continue to share my findings with you as I learn along the way.</p>\n\n",
			"date_published": "2017-04-07T00:00:00-06:00",
			"url": "http://localhost:4000/how-creating-a-call-flow-helps-sales-calls"
		},
		
		{
			"id": "lower-rates",
      
			"title": "Lower Your Rates (Sometimes) - Investing In Building Your Portfolio",
			
			"content_html": "<p>As developers, we hear the echo chamber on Hacker News and others shouting at us to raise our rates. We are worth it.  In theory they are right, we are worth it and we should be charging an industry standard rate.  However, there are some instances when it’s OK to lower your rates.</p>\n\n<p>Here are 3 times when you should consider lowering your rates:</p>\n\n<h2 id=\"1-building-your-portfolio\">1. Building Your Portfolio</h2>\n\n<p>This is definitely the case when you are first starting out. If you don’t have a solid portfolio, why should a client trust you to build their project at full rate. You have no credibility and they would be better off using a large shop that charges the same rate, but has hundreds of apps under their belts.</p>\n\n<p>Even if you are not just starting out, this can be a great strategy to employ if you are wanting to land a client that will “look good” in your portfolio.  We have done this in the past when we have wanted to break into certain markets.  We found some of the leaders in those markets, given them a killer deal (or built small projects for them) so that we were able to put their logo on our website.</p>\n\n<p>This strategy has proven to be incredibly successful for <a href=\"http://pixegon.com\">Pixegon</a></p>\n\n<h2 id=\"2-longer-term-engagements\">2. Longer Term Engagements</h2>\n\n<p>Our overall goal is to make money and provide sustainability as indie software developers. If you get an opportunity for a longer engagement on a project you enjoy working on, this often times can be much more valuable than trying to get your full rate.</p>\n\n<p><strong>Example:</strong></p>\n\n<p>3 month gig at $125/hour <strong>VS</strong> 6 month gig at $100/hour</p>\n\n<ul>\n  <li>3 months * 172 hours * $125 = <strong>$64,500</strong></li>\n  <li>6 months * 172 hours * $100 = <strong>$103,200</strong></li>\n</ul>\n\n<p>In my opinion, I would MUCH rather be working on a <em>larger</em> contract at a lower price than a shorter one at a higher price.  At the end of the day, it’s all about the contract value and sustainabilty.</p>\n\n<h2 id=\"3-on-the-job-training\">3. On The Job Training</h2>\n\n<p>As students of computer science, we should be able to build anything right? Well, sort of.  In the past, there have been instances when clients have asked me to work in unfamiliar territory. Whether that is using a programming language I have never written in, or working in a field that I don’t know much about.</p>\n\n<p>Rather than just declining these types of contracts and pigeon holing yourself into one area of practice, try giving the client a discount while you come up to speed. This benefits both you and the client.  You, get on the job paid training to learn new concepts and expand your area of expertise, and the client gets their product built for a significantly lower cost.</p>\n\n<h2 id=\"final-thoughts\">Final Thoughts</h2>\n\n<p>Rates are a weird thing. I would encourage you to constantly experiment. Raise them, lower them, exchange some for equity. Find out what works for you and your clients.</p>\n",
			"date_published": "2017-03-06T00:00:00-07:00",
			"url": "http://localhost:4000/lower-rates"
		},
		
		{
			"id": "the-importance-of-side-projects",
      
			"title": "Side Projects",
			
			"content_html": "<p>Over at <a href=\"http://pixegon.com\">Pixegon</a>, I really try to encourage my developers to have their own side projects.  Often times, employers look at side projects as competition and try to own the works that their developers produce.  Some will even go as far as to include this in their employee handbooks.</p>\n\n<p>In my opinion, this stifles creativity and creates a feeling of contention between the employee and company.</p>\n\n<p>People start side projects all of the time for a variety of reasons:</p>\n\n<ul>\n  <li>To make some extra cash</li>\n  <li>To learn a new technology</li>\n  <li>To sharpen one’s skills</li>\n  <li>Just for fun</li>\n</ul>\n\n<p>From an employer’s standpoint, these are all <strong>great</strong>. It allows my developers the freedom to learn new things, make mistakes, and even earn extra cash. All without me fronting the cost.</p>\n\n<p>While this might now sound selfish, it’s obviously a two-way street. Developers greatly benefit from this type of arrangement.</p>\n\n<h3 id=\"getting-started-with-a-side-project\">Getting started with a side project</h3>\n\n<p>This is one I struggle with all of the time.  Sometimes it’s a motivation issue, sometimes I lack an idea, and sometimes I’m just feeling lazy and end up reading Hacker News instead due to my analysis paralysis.</p>\n\n<p>The best bet is to just <strong>start</strong>. Whether your idea is big or small, stupid or world changing, just start writing some code. I try to utilize this tactic in all areas of my life from code, to writing, to working out, to minimizing, and even saving money.  Once you get some momentum going, you will quickly find out what’s working and what’s not.</p>\n\n<p>Here are a few Hacker News Posts that I found particularly inspiring to get you started:</p>\n\n<ul>\n  <li><a href=\"http://blog.andyjiang.com/how-to-ship-side-projects/\">How To Ship Side Projects</a></li>\n  <li><a href=\"https://news.ycombinator.com/item?id=8844083\">Those making $1,000+/month on side projects – what did you make?</a> (similar posts below)\n    <ul>\n      <li><a href=\"https://news.ycombinator.com/item?id=12670731\">https://news.ycombinator.com/item?id=12670731</a></li>\n      <li><a href=\"https://news.ycombinator.com/item?id=8800788\">https://news.ycombinator.com/item?id=8800788</a></li>\n      <li><a href=\"https://news.ycombinator.com/item?id=11898992\">https://news.ycombinator.com/item?id=11898992</a></li>\n    </ul>\n  </li>\n  <li><a href=\"http://livingliferichly.com/epic-list-of-side-project-ideas-for-programmers/\">Epic List of Side Project Ideas for Programmers</a></li>\n  <li><a href=\"https://news.ycombinator.com/item?id=5234692\">Ask HN: Where do you get ideas to build side-projects?</a></li>\n</ul>\n\n<p>Dont’ have any idea to start on? Try cloning something in one of the above posts. There are <em>tons</em> of ideas in here large and small and there’s plenty of room on the web for variances of differenct products. I probably stole most of this post from somewhere…</p>\n\n<p>If you found this post helpful and want to hear more, make sure to <a href=\"http://brandontreb.us3.list-manage1.com/subscribe?u=66135759856eefe4f6dcec97c&amp;id=ef6c358d78\">subscribe to my newsletter</a>. It’s not spammy, just let’s you know when I post.</p>\n",
			"date_published": "2017-02-06T00:00:00-07:00",
			"url": "http://localhost:4000/sideprojects"
		},
		
		{
			"id": "something-new",
      
			"title": "Trying Something New",
			
			"content_html": "<p>Every single year since the beginning of time (at least since the beginning of this blog), I have resolved to “blog more”.  And every single year, I have absolutely failed at that.</p>\n\n<p>So, in favor of <a href=\"http://www.businessinsider.com/set-goals-not-resolutions-tim-ferriss-2016-12\">systems over resolutions</a>, I am attempting to do something different this year.  Over the holiday, I blogged 12 posts related to my experiences as an independent software developer as well as business owner that I feel could benefit the community.  These share everything from selling contracts to hiring friends, mistakes made, and more.</p>\n\n<p>I plan on releasing one post a month on the first Monday of every month.  Given that I already have these posts written, it <em>should</em> be a no-brainer to blog consistently. I also intend on writing in-between posts, but at this point that’s probably wishful thinking.</p>\n\n<p>If you have any interest in this sort of thing (software development consulting), then be sure to add yourself to the <a href=\"http://brandontreb.us3.list-manage1.com/subscribe?u=66135759856eefe4f6dcec97c&amp;id=ef6c358d78\">mailing list</a>.</p>\n\n<p>Wishing you a successful and exciting 2017.</p>\n\n<p><strong>Cheers!</strong></p>\n",
			"date_published": "2017-01-02T00:00:00-07:00",
			"url": "http://localhost:4000/something-new"
		},
		
		{
			"id": "empathy",
      
			"title": "Develop Your Empathy Muscles For Great Good",
			
			"content_html": "<p>A while back,  I made a flagrant comment on Twitter about how I assumed the world worked.  It was something to the effect of “The internet levels the playing field, so someone without a job is without excuse”.  Not shortly after I hit “Tweet”, did I receive an array of Tweets back from people I highly respected.  I was immediately humbled, and it was pointed out to me that I had a severe lack of empathy.</p>\n\n<p>I’m sure I was just lamenting from a previous encounter with someone who I felt was acting entitled and felt they deserved something unearned. We tend to take situational experiences and generalize them.  I’d imagine this is how stereotypes are formed. But this conversation really opened my eyes to something I had never thought about before: <em>empathy</em>.</p>\n\n<blockquote>\n  <p><strong>em·pa·thy</strong> noun<br />\nthe ability to understand and share the feelings of another.</p>\n</blockquote>\n\n<p>As software developers, it is our job to see things from other people’s perspectives.  Without practicing empathy, we end up wasting our time trying to solve problems that don’t really exist.  We also miss huge niches/opportunities simply because a problem that needs solving doesn’t relate to us.</p>\n\n<p>So, how can you practice and develop empathy?</p>\n\n<p>First, start by listening, a lot. You can’t expect to understand another person’s perspective without fully hearing what that is.  In relation to this, you need to set aside your own viewpoint or opinion.  Simply, hear the other person’s point of view without judgement.</p>\n\n<p>Second, go outside of your comfort zone. Spend some time with people you might not normally encounter.  These could be people with opposing politics/religion/world views/etc… Another good place to start is with people who are in need. I have learned many valuable lessons from visiting soup kitchens, elderly care facilities, and mission trips to impoverished countries.</p>\n\n<p>Finally, attempt to understand the needs of the people around you whether you’re in the coffee shop, grocery store, or the office. There is always opportunity to learn and to grow if you are simply mindful.</p>\n\n<p>Practicing empathy on a day to day basis will not only allow you to see and solve problems others don’t, it will also make you a better human.</p>\n",
			"date_published": "2016-04-11T00:00:00-06:00",
			"url": "http://localhost:4000/empathy"
		},
		
		{
			"id": "how-to-lose-300k-in-one-conversation",
      
			"title": "How To Lose $300K In One Conversation",
			
			"content_html": "<blockquote>Will you work for equity?</blockquote>\n<p>After you have been consulting for any amount of time, you are bound to get asked this by a client.  You may find yourself struggling to decide whether or not to take some equity or just get paid to work on the project like you normally do.</p>\n\n<p>I had one such scenario a while back that I wanted to share. One day a few months ago, I was approached by a local VC in town.  Our relationship falls somewhere between acquaintance and friend; let’s call him Joe.  Joe has a very successful background and is one of the more wealthy people in my circle of influence.</p>\n\n<p>Joe asked me out for beers to discuss a new opportunity for a mobile project.  I, of course obliged and met him out. During this meeting, Joe proceeded to tell me about an application he wanted me to build that would be aimed at teenagers.  The gist was: <code class=\"highlighter-rouge\">They would create rooms and the \"cool kids\" could vote other kids in and out of the rooms</code>.</p>\n\n<p>The offer he made was 30% of the application ownership and profits and a small share in one of his existing startups.  Given Joe’s history, I knew this would most likely be a successful endeavor, however I told him that I had to think about it.  Given the nature of the app, I had some strong moral objections to creating a tool that would allow teens to ostracize each other.  This didn’t quite sit right with me.</p>\n\n<p>After taking a few days to think I it, I ultimately told Joe that I didn’t feel right about working on the application.  He said “no worries”, and that was the end of that conversation.</p>\n\n<p><strong>6 Months Later…</strong></p>\n\n<p>Some time had passed and Joe and I eventually met up for beers.  After a bit of discussion, he said “Hey, I wanted to tell you about that app”.</p>\n\n<p>He then follows with “I found a college kid to work on the application and gave him the same offer that I gave you.  I also had a designer do some very basic mocks of the application. While I was out on a trip to Silicon Valley, I mentioned the application to a good friend of mine at Facebook.  Well, Facebook has a similar product coming out (turned out to be Rooms) and they decided to give me a quick check for $1.1mm to discontinue work on the product. I then wrote the college kid a check for $333K <strong>before he’d written a single line of code</strong>!”.</p>\n\n<p>My immediate thought was “at least I still have my values”.  It’s pretty funny to look back and think about how I could have made so much money so quickly. However, even if I had known the potential payout up front, I don’t believe I would have still taken the project.  It would have eaten me up inside.</p>\n\n<p>The takeaway of this story is twofold.   First, I’d urge you to choose your compensation wisely.  Before this encounter, I would always give a hard “no” when asked about equity share as part of compensation. I now take it on a person by person basis.  Second, don’t compromise your morals for money.  I look back on this story as a success and wouldn’t change a single thing about it.</p>\n",
			"date_published": "2016-02-08T00:00:00-07:00",
			"url": "http://localhost:4000/how-to-lose-300k-in-one-conversation"
		},
		
		{
			"id": "why-consult",
      
			"title": "Why Start Software Consulting",
			
			"content_html": "<p>Want to jump ship and be a software development consultant? This post will detail why this path is a much more fulfilling and safer path than a traditional job.</p>\n<h3>Diversifying Income</h3>\n<p>Early in my career, I worked for a software consulting agency.  I was in my early 20’s and getting paid way more than I should.  One day, my boss called me up and let me go without notice.</p>\n\n<p>After interviewing quite a few developers in the consulting space, I quickly realized that this is a very common story.  If you work for a company, they can usually let you go at any time for any reason. Given that this is your sole source of income, you are now in an extremely risky situation.</p>\n\n<p>Contrast this with being an independent consultant.  Most likely, if you are consulting you have 1 or more clients.  In addition to that, you have some sort of pipeline set up.  So when you lose a client, you simply pull another from your pool.</p>\n<h3>Mo Clients Mo Money</h3>\n<p>The going rate of a senior software development consultant is between $100-$125/hour.  At this rate, you are looking at pulling in somewhere between $16K-$20K/month.</p>\n\n<p>Working for a traditional company, you would be hard pressed to command this salary even after having 10+ years of experience.  I’m not joking, kids who learned to code on Udemy in 6 months were making this while I had a salary cap of around $100K.</p>\n<h3>Commuting</h3>\n<p>In the U.S. , car accidents are one of the leading causes of death among young people.  Obviously, consulting can help mitigate this risk by allowing you to work from home or close to it. Therefore, further limiting your physical safety risk.</p>\n\n<p>In addition to limiting safety risk, not having to commute has financial advantages.  Since going independent, my family has cut down our need to a single vehicle saving us money on car payments, maintenance, gasoline, insurance, and most importantly <strong>time.</strong></p>\n<h3>Flexibility Of Location</h3>\n<p>When you don’t have to work in a traditional office, you are free to work anywhere in the world.  This could be coffee shops, the park, or even on a cruise ship.</p>\n\n<p>I typically like working in my shipping container office (post on that in the future) or wherever my wife has chosen to take the kids on a field trip that week.</p>\n<h3>Flexibility Of Time</h3>\n<p>When I worked at a traditional company, I was required to be signed in and available from 9-5 Monday - Saturday.  As you can imagine, this has a huge impact on how you plan your free time.   It’s also extremely limiting when you are trying to plan a trip or vacation.</p>\n\n<p>As a consultant, you have 100% control over your time.  This allows you to live life more on your terms.  If you enjoy staying up late and hacking until 3am, you can then enjoy sleeping in until 11.</p>\n\n<p>My wife and I currently homeschool our kids.  So when we want to take a trip, it’s literally a matter of leaving our house.  We don’t have to ask for time off, we don’t have to plan around other people.  We can quite literally drop everything and head to Disney World during the “deadest” parts of the year and enjoy doing things while others are “working”.</p>\n\n<p>I have found this level of flexibility has greatly improved my quality of life.</p>\n<h3>Unlimited PTO</h3>\n<p>This sort of goes with what I said above. Traditionally, if you want to take off time you need to:</p>\n<ol>\n    <li>Make sure it's cool with your boss</li>\n    <li>Make sure it's cool with your team</li>\n    <li>Give 2 weeks notice</li>\n    <li>Fill out paperwork</li>\n    <li>Burn through your limited \"vacation days\"</li>\n    <li>Still take calls from vacation because your are a \"nice guy/gal\"</li>\n</ol>\n<p>When you are a consultant, the process becomes:</p>\n<ol>\n    <li>Leave for vacation</li>\n</ol>\n<h3>You Are Your Own Boss</h3>\n<blockquote>\"So, Peter, what's happening? Aahh, now, are you going to go ahead and have those TPS reports for us this afternoon?\" - Bill Lumber</blockquote>\n<p>I never want to have a “boss” again. It’s true. I hate the thought of someone constantly breathing down my neck watching my every move.  I also can’t stand the idea of someone giving me a ”performance report”.</p>\n\n<p>When you become a consultant, it should be obvious, but you are the boss.  Early on, I would make the joke when my wife asked me to go on a random adventure “Let me check with my boss”.  Hilarious right?</p>\n<h3>Working In Your Underwear</h3>\n<p>Unless you are a Victoria Secret model, chances are you actually have to put on pants to go to work.  Not with consulting! I’m so glad I met my wife before I became a consultant, otherwise there would be no chance of me landing her wearing some of the choice outfits I do during work hours.</p>\n\n<p>I find my level of quality goes up with my level of comfort.  It never made sense to me why companies preferred “business casual” over “sleep professional”.  Seems like millions in lost revenue.</p>\n<h3>Other Benefits</h3>\n<p>This list is in no way meant to be exhaustive. These are just some of my favorite perks that I have been enjoying over the years. If you have some others that I have missed, please feel free to add your comments below.</p>\n",
			"date_published": "2016-01-25T00:00:00-07:00",
			"url": "http://localhost:4000/why-consult"
		},
		
		{
			"id": "goals-2016",
      
			"title": "2016 Goals",
			
			"content_html": "<p>As the new year kicks off in full swing, I am reflecting on <a href=\"http://brandontreb.com/goals-for-2015/\">my 2015 goals</a> and setting some new ones for 2016.</p>\n\n<p>Here is how I did on each of last year’s goals:</p>\n<ul>\n    <li><strong>Create a business plan</strong> - <span style=\"color: #993300;\">Fail</span>. I did not create a business plan for Pixegon.  This might have to carry over.</li>\n    <li><strong>Grow Pixegon (my mobile consultancy) to 2x 2014 revenue</strong> - <span style=\"color: #008000;\">Success</span>. We not only achieved this goal, but surpassed it. Pixegon did a total of $1.1mm in revenue in 2015!</li>\n    <li><strong>Hire a “director” - </strong><span style=\"color: #008000;\">Success</span>. OK, so this one is sort of in the middle. I didn't quite hire a director per se, however I did elevate my senior employees to more management roles. This allows them to take some of the day to day tasks off of my plate.</li>\n    <li><strong>Move to a weekly - </strong><span style=\"color: #993300;\">Fail</span>. But I'm OK with it. This isn't very important.</li>\n    <li><strong>Morning Routine</strong> - <span style=\"color: #ffcc00;\">Moderate</span>. Some days were better than others</li>\n    <li><strong>Blog twice a month - </strong><span style=\"color: #993300;\">Huge Fail</span>.  I averaged .41 times per month.</li>\n    <li><strong>Take off / reduce workload - </strong><span style=\"color: #008000;\">Success</span>. More camping!</li>\n    <li><strong>Give away more than 10% of personal income - </strong><span style=\"color: #008000;\">Success</span>. Our family was blessed with multiple opportunities throughout the year to be a blessing to others in addition to our normal donations.</li>\n</ul>\n<p>Overall, I’d call 2015 a success. I managed to hit the goals I felt most passionate about, and more importantly, this exercise has helped me to determine what I should focus on.  With that being said here are my goals for 2016.</p>\n<ul>\n    <li><strong>Professional</strong>\n<ul>\n    <li>Land <strong>ONE</strong> new client.  Sounds crazy I know, but allow me to explain.  Pixegon has been fortunate enough to work with some <a href=\"http://www.pixegon.com/more-works\">pretty incredible clients</a>.  Many of these clients trust us to be their primary dev team throughout the year. I intend on finding at least ONE more client like these in 2016 (Referrals welcome ;) ).</li>\n    <li>Build Something New. As I continue to build a company, it's often hard to get back to my roots of writing code and actually creating something. I miss this. It provided so much value to me over the course of the years. So, this year, I want build some \"side projects\".</li>\n    <li>Hire. I hope to grow the team by at least 20% this year.  (<a href=\"http://www.pixegon.com/join-our-team/\">We are always hiring most positions</a>).</li>\n</ul>\n</li>\n    <li><strong>Personal</strong>\n<ul>\n    <li>Be more intentional about EVERYTHING.  I have really been into a few blogs lately (<a href=\"http://www.mrmoneymustache.com\">Mr Money Mustache</a>, <a href=\"http://www.theminimalists.com\">The Minimalists</a>, <a href=\"http://fourhourworkweek.com/blog/\">4-Hour Workweek</a>, etc...).  What I have really learned is that I want to be more intentional about everything I do (Family, Time, Money, etc...).  Part of this is removing my dependency on my phone, simplifying my life, and scheduling undivided time for the things that are important.</li>\n    <li>Stop Complaining. I read this incredible book called <a href=\"http://www.amazon.com/gp/product/0770436390/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=0770436390&amp;linkCode=as2&amp;tag=codnerandnon-20&amp;linkId=JCWEFBN6BTYDX2OC\" rel=\"nofollow\">A Complaint Free World</a> . He talks about the power of Not complaining. This has really resonated with me.</li>\n    <li>Blog Twice Per Month. OK This time I mean it (1 down, 23 to go! )</li>\n    <li>Read 5 books. Arbitrary amount I know, but I need something measurable.</li>\n</ul>\n</li>\n</ul>\n<p>That’s it. Here’s to a healthy and productive 2016!</p>\n\n<p>Feel free to link me to your 2016 goals blog posts in the comments.</p>\n",
			"date_published": "2016-01-11T00:00:00-07:00",
			"url": "http://localhost:4000/goals-2016"
		},
		
		{
			"id": "the-value-of-quality-assurance",
      
			"title": "The Value Of Quality Assurance",
			
			"content_html": "<p>It’s late, you have been hacking all night to get the client a build.  Finally, around 2:30 am, you hit submit and publish something to the client and go to bed.  When you wake up in the morning, the first thing you see in your inbox is an email titled “Completely Broken!!1!”.</p>\n\n<p>How could this be? You stayed up late, you hacked, you tested and you sweat over this build to find that it crashes for the client when they try to do something obvious.</p>\n\n<p>As developers, we often can’t see the forrest through the trees.  What this means is, we get so deep into the code working on a new feature or fixes that we often don’t notice when we break things. This doesn’t mean that we are bad developers, it just means we think differently about development.  It also means we can’t personally handle <strong>everything</strong>.</p>\n\n<p>However, from a client’s perspective, failures like this can really tarnish your brand.  They start to get the impression that you are unprofessional and even worse, start to doubt your abilities as a developer.</p>\n\n<h3 id=\"enter-qa\">Enter QA</h3>\n\n<p>QA (short for quality assurance) is an idea that someone other than the developer tests the build before the client ever sees it.  These people are responsible for</p>\n\n<ul>\n  <li>Regression testing (as in the scenario above)</li>\n  <li>Generating a test plan/matrix</li>\n  <li>Ensuring parity (if needed) between multi-platform applications</li>\n</ul>\n\n<p>If the QA team is doing it’s job, the client won’t every see these obvious failures mentioned above.  This can greatly improve the client’s perception of you/your team.</p>\n\n<h3 id=\"basic-process\">Basic Process</h3>\n\n<p>OK, QA sounds great, how do I get started?  Well, it’s actually relatively simple. First off, I assume you are doing <em>some flavor</em> of agile, and hopefully logging tickets for each task.  If not, you should (even if you are a one man show).  Here is a rough flow that my team follows:</p>\n\n<ol>\n  <li>Developers determine which tickets to work on for the current sprint</li>\n  <li>Developers complete a ticket and move it to a “dev complete” column in the task manager (Jira, Trello, Pivotal Tracker, etc…)</li>\n  <li>Developers deliver a build internally</li>\n  <li>The QA team takes the build and goes through their testing matrix to check for regressions.\n    <ul>\n      <li>If a regression is found, a bug ticket is created for the responsible developer</li>\n    </ul>\n  </li>\n  <li>New features are added to the QA test matrix and tested\n    <ul>\n      <li>If the feature has bugs or doesn’t work as intended, the ticket is rejected and pushed back to the developer</li>\n    </ul>\n  </li>\n  <li>Once everything passes, the build is green-lit to be sent to the client (usually one build per sprint)</li>\n</ol>\n\n<p>Like anything, you may develop your own version of the above, however this should be a detailed enough outline to get you started.</p>\n\n<h3 id=\"pushback\">Pushback</h3>\n\n<p>In my experience, clients will generally give you some pushback when you say that you are billing them for QA hours.  They will say things like “It’s OK, I can test the build myself.” or “I understand, things won’t be perfect. We will through this together”.</p>\n\n<p>While this all sounds good at the surface, the fact of the matter is, it almost always will end unfavorable.  The client might have some level of tolerance early on, but as you start sending them more and more builds, each potentially missing/breaking features, they will become less patient.  I have seen this happen plenty of times even with the most tech savvy of clients.  Here are a few ways you can build QA into your billing process:</p>\n\n<p><strong>Add it as a line item</strong></p>\n\n<p>This is where you will most likely see the most opposition.  Make sure to explain to the client that their time is valuable and you don’t want to waste it.  Also, ensure that the cost of QA is drastically less than the cost of engineering or you will get questions like “Why am I paying you full price to test?”.</p>\n\n<p>Be sure to tell the client that QA is just part of your team’s process. You simply don’t operate any other way as you <strong>know</strong> that this is the best approach for both parties.  Hopefully, this will establish your expertise in the domain and the client will respect you for that.</p>\n\n<p><strong>Bake it into the cost of engineering</strong></p>\n\n<p>Often times, you may not bother with too many line items.  You may just have something like <strong>Engineering $200/hour</strong>.  When/If the client gives any pushback about cost compared to other shops, simply inform them of all they are getting inside of that hour (Engineering, Consulting, QA, Project management, Office management, etc…).  It actually works out to be a much greater value for them than paying say $125/hour for a “code monkey”.</p>\n\n<h3 id=\"final-thoughts\">Final Thoughts</h3>\n\n<p>I absolutely believe that QA is crucial to the success of any software agency or freelancer. Not only does it allow you to come across as more professional, it also helps keep you sharp as a developer. While I’m not suggesting QA is a silver bullet (I still believe in Unit / Automated testing), I feel that everyone should at least have some layer baked into their process.</p>\n",
			"date_published": "2015-07-28T00:00:00-06:00",
			"url": "http://localhost:4000/the-value-of-quality-assurance"
		},
		
		{
			"id": "ship-products-you-are-proud-of",
      
			"title": "Ship Products You Are Proud Of",
			
			"content_html": "<p>There is a familiar phrase that I hear all too often when a client comes to me with an existing application.  It goes something like this:</p>\n\n<p>“Our team spent quite a bit of money on our application and we don’t want to ship it.  <strong>We are</strong> <strong>not proud of the product</strong>.”</p>\n\n<p>It blows my mind that many developers and development teams are still in business given the poor quality of products that I see getting churned out all of the time.</p>\n\n<p>When I encounter these types of situations, I immediately know that the team (or individual) behind them is much more interested in a ‘quick buck’ instead of the longevity of their company.  Poor quality in software is directly related to cutting corners.</p>\n\n<p>A few examples of cut corners:</p>\n\n<ol>\n  <li><em>Using inexperience developers without proper guidance</em>.  I am all for hiring ‘staff’ level developers, however, they must be properly mentored and trained so that there is no compromise on quality.  If you must compromise on something, compromise it on <em>time</em>.</li>\n  <li><em>Outsourcing the project without proper guidance</em>.  Although I don’t prefer outsourcing given the communication challenges, I am not opposed to it.  There are plenty of talented individuals all over the world.  However, given the varying degree of abilities and communication issues, one must not rely 100% on an outsourced team to ship a product.</li>\n  <li><em>Not following coding standards/guidelines.</em>  This could be things such as: not commenting code, not testing, not leveraging a QA team, or simply writing “smoke an mirror” code.</li>\n</ol>\n\n<p>I can usually identify immediately which of the above applies after spending a few minutes with the code.  In fact, I have built much of <a href=\"http://pixegon.com\">my business</a> around saving these types of projects.</p>\n\n<p>So I urge you, although it might cut into my market share, *please *build something you are proud of.  This is not only the right thing to do, it is also **critical **to your future success as an independant software developer.</p>\n\n<div style=\"\">\n  <a href=\"http://twitter.com/share\" class=\"twitter-share-button\" data-count=\"horizontal\" data-text=\"Ship Products You Are Proud Of\" data-url=\"http://brandontreb.com/ship-products-you-are-proud-of\" data-via=\"brandontreb\" data-related=\"brandontreb:\">Tweet</a>\n</div>\n\n",
			"date_published": "2015-04-07T00:00:00-06:00",
			"url": "http://localhost:4000/ship-products-you-are-proud-of"
		},
		
		{
			"id": "app-idea-likely-falls-one-three-categories",
      
			"title": "Your App Idea Most Likely Falls Into One Of Three Categories",
			
			"content_html": "<p>During my years of mobile development, I have heard the phrase “I have an idea for an app!” hundreds, if not thousands of times.  Sometimes it would be from family members, sometimes my dentist during a cleaning, and sometimes from a naked dude standing in the sauna at the gym.  Everyone pitches app ideas to me.</p>\n\n<p>What I have learned from hearing so many pitches is this: apps really fall into one of three (sometimes four) categories.  Allow me to elaborate.</p>\n\n<h4 id=\"1-theapp-has-been-done-before\">1. The app has been done before</h4>\n\n<p>This is the most common category of app idea I hear.  Usually, these are along the lines of, “It’s like Instagram, but for finger painters…”, etc… where the user takes an already proven idea and tries to tweak it in some way that they feel makes it new.  Most of the time, these people have not even done any research to check as to whether or not a solution already exists.</p>\n\n<p>The biggest hurdle in developing an app that has been done before is visibility; How are they going to get people to find the app and why should they choose it over the competition?</p>\n\n<h4 id=\"2-theapp-idea-is-too-niche\">2. The app idea is too niche</h4>\n\n<p>Every now and again, I will hear a truly unique idea.  Keep in mind, unique does not necessarily mean good.  For example, I might hear, “I want an app that you can take photo of your cat, put it on a weather balloon, and send the balloon to space.  ‘Catz In Spaze!’”.  While this is unique, and <em>technically </em>feasible, one would be hard-pressed to make a real business out of it as it would be hard to get enough users on board to make it profitable.</p>\n\n<h4 id=\"3-there-is-a-reason-theapp-does-not-already-exist\">3. There is a reason the app does not already exist</h4>\n\n<p>“I want an app to map out all of the grocery stores layouts in the world, so husbands can finally shop efficiently!”  This is a great idea.  It really is.  So great, that I have literally heard it no less than ten times from various people over the years.  Often times, I can predict when someone is about to pitch this particular idea, just by the setup: “You know how, like, shopping is hard, and like, you can’t find stuff…”.</p>\n\n<p>There are some real technical hurdles surrounding this problem.  While there are a few apps that have tried to solve it, no app will really accomplish the goal unless they have all of the following: total store participation, a large enough group for crowdsourced data, faster and more reliable GPS to know <em>exactly</em> where you are in the store, stores stop changing layouts, etc… You get the idea.  There are a lot of reasons a solid solution for this does not exist.</p>\n\n<p>There are other countless examples of app ideas falling into this category.  Another fun one I get pitched is a killer app that converts any photo into a (caricature) [http://en.wikipedia.org/wiki/Caricature].  I’m sure someone will link one in the comments, but they are all mediocre at best.</p>\n\n<h4 id=\"bonus-4-the-app-is-used-to-augmenttheirexisting-business\">Bonus #4: The app is used to augment their existing business</h4>\n\n<p>This is actually my favorite type of app to work with.  The user has an existing business and wants to build something that benefits their business in the mobile space.  I see ideas from evaluation tools for employees to apps that allow users to order products directly from the business.</p>\n\n<p>I like these because the success of the business does not depend entirely on an app.  Also, there is generally an audience built right in at launch time so everyone is happy.</p>\n\n<h4 id=\"conclusion\">Conclusion</h4>\n\n<p>I am not writing this post because I’m jaded and sick of hearing app ideas.  Quite the contrary.  I love hearing app ideas and would love to hear examples challenging the stereotypes that I have created here.</p>\n\n<p>I give this spiel to clients from time to time and wanted a place that I could point them to, so feel free to send your clients to this post the next time you get the grocery store mapper pitch.</p>\n\n<p> </p>\n\n<p> </p>\n\n<p> </p>\n\n<p> </p>\n\n<div style=\"\">\n  <a href=\"http://twitter.com/share\" class=\"twitter-share-button\" data-count=\"horizontal\" data-text=\"Your App Idea Most Likely Falls Into One Of Three Categories\" data-url=\"http://brandontreb.com/app-idea-likely-falls-one-three-categories\" data-via=\"brandontreb\" data-related=\"brandontreb:\">Tweet</a>\n</div>\n",
			"date_published": "2015-01-27T00:00:00-07:00",
			"url": "http://localhost:4000/app-idea-likely-falls-one-three-categories"
		},
		
		{
			"id": "goals-2015",
      
			"title": "Goals For 2015",
			
			"content_html": "<p>It cannot be overstated that writing down one’s goals is critical to acheiving them. Pair that with sharing them with others who might help keep you accountable and your probabilty of achieving those goals goes way up.</p>\n\n<p>With this in mind, I have decided to share my 2015 goals here on my blog in hopes that I will do a better job of acheiving them in the new year. I tried to focus on more measurable goals rather than things like “eat better” and “exercise more”.</p>\n\n<p>So, here they are in no particular order.</p>\n\n<p><strong>Professional</strong></p>\n\n<ul>\n  <li>Create a business plan</li>\n  <li>Grow <a href=\"http://pixegon.com\" target=\"_blank\">Pixegon</a> (my mobile consultancy) to 2x 2014 revenue</li>\n  <li>Hire a “director” to help with oversight of current developers</li>\n  <li>Move to a weekly rate instead of hourly</li>\n</ul>\n\n<p><strong>Personal</strong></p>\n\n<ul>\n  <li>Be consistent with morning routine\n    <ul>\n      <li>wake up early, pray, blog, mediate, read Bible, write down <a href=\"http://zenhabits.net/purpose-your-day-most-important-task/\" target=\"_blank\">MITs</a>,</li>\n    </ul>\n  </li>\n  <li>Blog twice a month</li>\n  <li>Grow the blog’s mailing list</li>\n  <li>Take off / reduce workload on Friday’s to spend the day with my family</li>\n  <li>Launch <a href=\"http://alpha.autumnv.com\" target=\"_blank\">Autumn Village</a></li>\n  <li>Give away more than 10% of personal income</li>\n</ul>\n\n<p>This list is definitely not complete, however it’s a good start. I hope to refine it over the coming months and more importantly, stick with it.</p>\n\n<p>What are your 2015 goals? I would love to hear about them in the comments or <a href=\"mailto://brandon@brandontreb.com\">via email</a>.</p>\n\n<div style=\"\">\n  <a href=\"http://twitter.com/share\" class=\"twitter-share-button\" data-count=\"horizontal\" data-text=\"Goals For 2015\" data-url=\"http://brandontreb.com/goals-2015\" data-via=\"brandontreb\" data-related=\"brandontreb:\">Tweet</a>\n</div>\n\n",
			"date_published": "2014-12-29T00:00:00-07:00",
			"url": "http://localhost:4000/goals-2015"
		},
		
		{
			"id": "software-development-contracts-fixed-bid-vs-time-materials",
      
			"title": "Software Consultant Contracts: Fixed Bid VS Time And Materials",
			
			"content_html": "<p>One of the most common questions I get from software consultants is whether or not to accept fixed bid contracts.  In this post, I’m hoping to shed some light on fixed bid vs. time and materials contracts and help you make the best decision for the project at hand.</p>\n\n<p>Let’s start with some definitions to help you better understand what I am talking about.</p>\n\n<p>A <strong>fixed bid</strong> <strong>contract</strong> is a contract where the developer and the client agree on a price and/or timeline up front for a particular contract.  If additional time is needed, there must be some sort of change order issued to and signed by the client.</p>\n\n<p>A <strong>Time and Materials contract</strong> is a contract where the developer and the client agree on an hourly rate for the development of a project.  While there should be some initial estimates up front, the developer is not locked into a certain number of total hours/dollars.  If more time is needed than stated in the original estimate, the developer has the freedom to continue as the client’s budget (and patience) permits.</p>\n\n<p>Below, I’ll compare and contrast the pros and cons of both fixed bid and time and materials contracts.  Note, this is just from my experience and your experience might vary.  In fact, if it does, I’d love to hear about it in the comments.</p>\n\n<h4 id=\"fixed-bid-pros\">Fixed Bid: Pros</h4>\n\n<ol>\n  <li><em>You can potentially make a lot more money</em>.<br />\n    If you are a good estimator (or a bad one and the client accepts an overbid), then this is your chance to get paid whatever you want to get paid per hour.  If you bid 100 hours and get it done in 50, you have essentially doubled your rate.</li>\n  <li>*It’s easier to manage the pipeline.<br />\n    *Generally, when you do a fixed bid contract (again assuming you are decent at estimations), fixing a contract allows you to plan out more contracts ahead of time.  Typically the fixed cost comes with a (roughly) fixed timeline.  This allows you to project future availability for yourself to work on other projects.</li>\n  <li><em>You know what you are building up front.<br />\n    *If you have done your due diligence (gathering requirements, specking things out, etc…) there </em>should* be no surprises.  Everything is already laid out for you and if the client wants to change anything, it will require a change order.</li>\n  <li>*You are selling value instead of time.<br />\n    *This is actually a hot topic lately.  Many will argue never to sell by the hour as so much more goes into your rate than just time (your knowlege, history, expertise, etc…) The client wants to pay your for a solution to their problem and that’s infinitely much more valueable than your time.</li>\n  <li>*It’s sometimes easier to land contracts.<br />\n    *Some clients have a very specific budget.  If you can provide a solution to them inside of their budget, then the contract is yours every time.</li>\n</ol>\n\n<h4 id=\"fixed-bid-cons\">Fixed Bid: Cons</h4>\n\n<ol>\n  <li><em>You can potentially lose a lot more money</em>.<br />\n    There is a joke that goes something like this: There are only 2 hard problems in software development, knowing when to expire a cache and accurately estimating working.  Generally, the overzealous developer will error on the side of too few hours in order to ‘land the contract’ or ‘please the client’.  This usually results in the developer bidding 50 hours and realistically working the 100.</li>\n  <li><em>Feature Creep.</em><br />\n    Clients WILL feature creep.  Feel free to tweet that or write it on your forehead.  It’s just a fact of life.  You, being the super nice developer that you are, will want to please the client and will say something like “it’s outside of scope, but I’ll make an exception”.  Before you know it, the app has pivoted and you are building things WAY outside the scope of the initial contract.</li>\n  <li><em>Can I…? NO! Well, what about…? NO! Just This… NO, NO, NO!</em><br />\n    With a fixed bid contract, if you are an experienced developer, you will ALWAYS be telling the client NO.  If you are wondering why, see #2.  While feature creep creates a tension, so does not allowing the client to change course, if needed.</li>\n  <li>*It’s sometimes harder to land contracts<br />\n    *If I take a fixed bid contract, I generally error on the side of overbidding.  This allows padding for things like QA, small changes, App Store submission, etc.  Given the high bid, your client might baulk at the contract and attempt to outsource to India himself, where he will eventually spend double.</li>\n</ol>\n\n<p>####</p>\n\n<h4 id=\"time-and-materials-pros\"><strong>Time And Materials: Pros</strong></h4>\n\n<ol>\n  <li>*Your work is always compensated<br />\n    *Given that you are getting paid per hour, you can always count on a steady stream of revenue coming in.  This is very comforting to developers since you know you will always get paid the rate you want for the work you do.</li>\n  <li>*Landing contracts can be easier<br />\n    *Clients don’t always know what they want up front and the idea of not committing to a certain dollar amount is sometimes comforting. It also gives them MUCH MORE freedom to make changes and pivot down the road.</li>\n  <li>*It gives clients the freedom to prioritize features<br />\n    *This is one of the biggest selling points that clients appreciate when I sell a time and materials contract.  Given that my team follows a version of the agile development methodology, clients love that they have some insight as to how much each feature roughly costs.  They can see the estimates and translate that into cost.  If they feel a less important feature is too costly, they can prioritize the backlog to get more (less complex) features for the same price.</li>\n  <li>*Less Risk<br />\n    *Since you are only selling the client your time, you don’t necessarily owe them anything except work.  Most of the time, time and materials contracts don’t even have an official scope of work attached.</li>\n</ol>\n\n<p><strong>Time And Materials: Cons</strong></p>\n\n<ol>\n  <li>*It doesn’t scale<br />\n    *You can never make more money than your time will allow. If you charge $100/hour and work 40 hours/week, then you can never make more than $4,000/week unless you work more.</li>\n  <li>*You are a commodity<br />\n    *The client doesn’t so much look at you as someone who is providing them a solution as they do a “resource”.  You are perceived as less valuable and therefore could easily be replaced.</li>\n  <li>*More Risk<br />\n    *I know this type of contract is listed as less of a risk above, but there is also some riskiness to it.  If you get in the weeds on a task or start introducing too many bugs, the client might feel that you are misleading them or incapable of performing and you risk getting released from the project.</li>\n</ol>\n\n<h4 id=\"takeaways\">Takeaways</h4>\n\n<p>While I have only scratched the surface in comparing these two types of contracts, I hope you have a better understanding about which route to pursue for you.  My advice is to not be too rigid stating “I’m only going to use contract type X forever” because each contract situation may vary.  Use your best judgement and make the decision that is best suited for each individual project and client.  At some point in the future, I will post a few tips for making this decision based on some factors, but that is for a later date.</p>\n\n<p>Until then, happy consulting!</p>\n\n<p>P.S. Make sure to sign up for the newsletter below to be notified about awesome posts like this in the future!</p>\n\n<div style=\"\">\n  <a href=\"http://twitter.com/share\" class=\"twitter-share-button\" data-count=\"horizontal\" data-text=\"Software Consultant Contracts: Fixed Bid VS Time And Materials\" data-url=\"http://brandontreb.com/software-development-contracts-fixed-bid-vs-time-materials\" data-via=\"brandontreb\" data-related=\"brandontreb:\">Tweet</a>\n</div>\n",
			"date_published": "2014-12-09T00:00:00-07:00",
			"url": "http://localhost:4000/software-development-contracts-fixed-bid-vs-time-materials"
		},
		
		{
			"id": "software-development-consulting-contract-tips",
      
			"title": "Software Development Consulting: Some Tips On Structuring Your Contracts",
			
			"content_html": "<p>When I first started out as an independent software developer, one of things that stressed me out the most was how to structure contracts that I sent to clients.  Working for a consultancy in my previous work-life I had seen contracts before, however, I never really paid enough attention to them to know what type of content went into them.</p>\n\n<p>After quite a bit of research, I found an invaluable resource.  Over at techrepublic.com, Chip Camden posted a beautifully crafted consulting contract template.  You can see the post and download the template <a href=\"http://www.techrepublic.com/blog/it-consultant/customizable-it-consultant-sample-contract/\">here</a>.  This post was a lifesaver.</p>\n\n<p>Chip goes over EVERY single section of the contract and gives an explanation of why it’s there.  You can download the template and determine which sections you need for your business, based on his explanations.  It doesn’t get much easier than that.  Of course, I would still strongly suggest you fork over a couple hundred bucks and have a lawyer look over the contract before sending it off to clients.</p>\n\n<h4 id=\"how-to-sign-contracts-online\">How To Sign Contracts Online</h4>\n\n<p>Once you have your contract in place, you will need a way to get your clients to sign it.  You could go the old-fashioned way of scanning, both parties signing, and scanning again OR you could use an online signature service.  One that I use and highly recommend is <a href=\"https://rightsignature.com\">RightSignature</a>. I know those guys personally and have had a great experience with the service so far.</p>\n\n<h4 id=\"here-is-my-process\">Here is my process:</h4>\n\n<p>This is what I have found works out well for my business.  #proTip: I have my assistant do this now 😉</p>\n\n<ol>\n  <li>Complete the contract blanks in regards to rates or any other information you want the client to see before they sign the contract.</li>\n  <li>Upload the contract template to Google Drive (optional).  Make sure your company info is completed and all of the other fields (dates, signatures, etc…) are blanked out.</li>\n  <li>Once inside of your RightSignature account, you can connect to your Google Drive and import the document in.  You can also upload them directly from your computer if you don’t want to use Google Drive.</li>\n  <li>RightSignature lets you put text fields and date boxes in the blanks and specify who is responsible for filling them out (you or the client).</li>\n  <li>Finally, add the signature fields at the bottom and send off the document for signing.</li>\n  <li>Once every party has filled out the needed information, the completed document is then sent to both parties via email.</li>\n</ol>\n\n<h4 id=\"other-considerations\">Other Considerations</h4>\n\n<p>Often times, the client will have their own contracts for you to sign.  This isn’t necessarily a bad thing.  However, make sure that you read over it carefully and run it by your lawyer.  Don’t try to force your contract on a client that already has their own.  They will usually not be open to this, in my experience.</p>\n\n<p>Make sure to have an ‘exit clause’ in your contract in case things go sour.  I seldom enter into fixed bid contracts so I usually have a clause where either party can cancel the contract with 7 days written notice.  This also makes the client feel at ease as they are not trapped with you in an event where their situation changes.</p>\n\n<p>Finally, be willing to be flexible.  Sometimes clients might not like certain clauses in your contract.  Be willing to change things like delivery dates, invoice dates, invoice periods, rates, etc… on a client to client basis.  Obviously, use your best judgement here.</p>\n\n<h4 id=\"conclusion\">Conclusion</h4>\n\n<p>I hope that you have found this post useful and it saves you some time hunting down a contract template.  I am always open to suggestions so if you see anything else that works for you, I would love to hear about it via email or in the comments.</p>\n\n<p>Please consider <a href=\"http://eepurl.com/QAAhf\">signing up for my email list</a> to get killer posts like this one delivered to your inbox.</p>\n\n<p><em>*Disclaimer: I am not a lawyer and do not claim to be giving any real legal advice.  I am simply stating how I do things with my business.  Make sure to consult with a lawyer before engaging in any contracts.</em></p>\n\n<div style=\"\">\n  <a href=\"http://twitter.com/share\" class=\"twitter-share-button\" data-count=\"horizontal\" data-text=\"Software Development Consulting: Some Tips On Structuring Your Contracts\" data-url=\"http://brandontreb.com/software-development-consulting-contract-tips\" data-via=\"brandontreb\" data-related=\"brandontreb:\">Tweet</a>\n</div>\n\n",
			"date_published": "2014-03-31T00:00:00-06:00",
			"url": "http://localhost:4000/software-development-consulting-contract-tips"
		},
		
		{
			"id": "indie-software-developer-signing-ndas",
      
			"title": "Being An Indie Software Developer And Signing NDAs",
			
			"content_html": "<p>Very frequently, I receive emails that go something like this:</p>\n\n<blockquote>\n  <p>“Hey Brandon, I have a killer project idea. Do you want to work on it?  Please sign the NDA so we can talk.”</p>\n</blockquote>\n\n<p>Early on when I first started consulting, I would have responded with something like “Sure send it over!” and signed the thing without hesitation.  As of late, I have changed my view on NDAs; at least in this type of situation.</p>\n\n<p>For those that don’t know, an NDA (non disclosure agreement) is a contract that is intended to protect the intellectual property of the client.  They make a lot of sense, especially in the event that the deal goes sour.  Say a client has some great idea for how to better take selfies that is going to revolutionize the selfie game.  If he doesn’t get a developer to sign an NDA, the developer could potentially be free to discuss the idea with others, leaving the idea open to be stolen.</p>\n\n<h3 id=\"why-i-dont-sign-preliminary-ndas\">Why I Don’t Sign Preliminary NDAs</h3>\n\n<p>In the scenario I mentioned above, it would be very unwise of me to sign this NDA as I don’t have enough information about the product.  This puts me as a consultant at a huge risk.</p>\n\n<p>Say for example I am working on a photo/video sharing app (I get roughly 1 request a week for some spin on Instagram). Now, say the incoming project is some variant on photo sharing. If I sign the NDA, it now now puts me in a conflict of interest with my existing project.</p>\n\n<p>Even if I knew that the project was a photo/video sharing application up front, I still would not sign the NDA.  Much of the time (as mentioned above) clients want <strong>very</strong> similar applications.  If I went around signing every single NDA that came across our desks, I would be out of business after the first client.</p>\n\n<h3 id=\"when-i-will-sign-ndas\">When I Will Sign NDAs</h3>\n\n<p>Well, the first thing that I do is ask for clarification on the project and tell them my NDA policy.  I basically tell them that I am happy to sign the NDA if one of the following conditions are met:</p>\n\n<ol>\n  <li>There is extremely proprietary information (you can’t land a big enterprise contract without first signing an NDA)</li>\n  <li>We are ready for project kickoff and all parties are aware of any potential conflicts</li>\n</ol>\n\n<p>In addition to that, if I am currently working on a project that is of similar type, it would be worthwhile to disclose that information to the potential new client (not the proprietary info, just that there is some overlap) so that they can choose whether or not to proceed.  Better to possibly lose the new client than end up in a crazy legal battle.</p>\n\n<p>If the new client refuses to give you any more information, then they are not worth your time.  They will most likely be too challenging to work with down the road anyway.</p>\n\n<h3 id=\"ndas-are-not-set-in-stone\">NDAs Are Not Set In Stone</h3>\n\n<p>When you do finally decide to sign the NDA, know that it is not complete until you sign it. If you see something that you don’t like or want to add any additional clauses, feel free to propose those to the client.  Most clients will be very understanding.</p>\n\n<p>That being said, it’s VERY IMPORTANT that you read all the way through an NDA and possibly run it by your lawyer before signing.</p>\n\n<h3 id=\"suggestion-if-you-want-your-nda-signed\">Suggestion If You Want Your NDA Signed</h3>\n\n<p>If you want a developer to sign your NDA, make sure to give him enough information about your project for him to make an educated decision.  If you just say “I want a photo sharing app” and expect an NDA signed, good luck.  Make sure that they know there is proprietary information involved and that you are doing something different that must be kept private.</p>\n\n<p>An NDA is not required if you want to make say an “Instagram Clone For Puppies” or a “Miley Cyrus Flappy Bird Clone”.  Be sensitive to the uniqueness of your idea and decide if it really warrants an NDA.</p>\n\n<p>Also note that developers are not out to steal your idea.  They get pitched hundreds of ideas and most of the time your idea falls into 3 categories anyway:</p>\n\n<ol>\n  <li>It’s not unique</li>\n  <li>There is a technical challenge and that’s why it hasn’t been done (I get pitched a lot of ‘Map a grocery store so that my list will navigate me around’ ideas)</li>\n  <li>Your idea is so niche and so unique that the general audience won’t get it and it won’t be profitable anyway</li>\n</ol>\n\n<p>I’m not saying that every idea falls into these categories. But a good majority do. Most of them fall under #1 and that’s not necessarily a bad thing.  Google fell into #1 and look where they are today.  Just keep these things in mind when requiring a signed NDAs before you will give out any info.</p>\n\n<h3 id=\"conclusion\">Conclusion</h3>\n\n<p>There has been quite a bit of discussion lately (especially on Hacker News) about whether or not to sign NDAs.  Most of the recent articles I have read are simply titled “I Will Not Sign Your NDA”.  I feel that NDAs have there place, but you should sign them only with extreme caution.  Examine each NDA on a case by case basis and determine how it will affect your business in the long run.</p>\n\n<p><em>*Disclaimer: I am not a lawyer and do not claim to be giving any real legal advice.  I am simply stating how I do things.  Make sure to consult with a lawyer before engaging in any contracts.</em></p>\n\n<div style=\"\">\n  <a href=\"http://twitter.com/share\" class=\"twitter-share-button\" data-count=\"horizontal\" data-text=\"Being An Indie Software Developer And Signing NDAs\" data-url=\"http://brandontreb.com/indie-software-developer-signing-ndas\" data-via=\"brandontreb\" data-related=\"brandontreb:\">Tweet</a>\n</div>\n",
			"date_published": "2014-02-28T00:00:00-07:00",
			"url": "http://localhost:4000/indie-software-developer-signing-ndas"
		},
		
		{
			"id": "becoming-software-consultant-backstory",
      
			"title": "Becoming A Software Consultant: My Backstory",
			
			"content_html": "<p>I recently published a post about <a href=\"http://brandontreb.com/learned-first-year-ios-consulting\">my first year of being an independent iPhone development consultant</a>.  The feedback from my readers was incredible, however there was one important thread on Hacker News that I wanted to address.  The issues were:</p>\n\n<blockquote>\n  <p>One of my common hangups with these kind of posts is the lack of history as to what lead people to these consulting gigs. Where were you before, and how long were you there?</p>\n</blockquote>\n\n<p>I found this to be a very valid point.  Far too often you see guys posting their end of the year profits from their consulting gigs and they make it sound extremely easy.  This can be dangerous as joe n00b might be so inspired that he quits his job and jumps right into the deep end without first preparing himself and assessing the risks involved.</p>\n\n<p>That being said, I wanted to write a bit about my backstory and how it ultimately lead to my ability to strike it out on my own as a consultant.  I have read stories similar to mine and there are a few key points that seem to be common, which I will highlight as I go.</p>\n\n<p><strong>Circa Summer 2008 – Just Before Apple Releases The iPhone (not iOS) SDK </strong></p>\n\n<p>In the summer of 2008, I was preparing to enter my senior year of college for Computer Science at UNM.  A quick note about CS in New Mexico.  There are TONS of government contractors (Sandia, Ultramain, Honeywell, Lockheed, etc.) in NM and college CS courses seem very much tailored to preparing students to head down this road towards one of these contractors.  This is where most of my buddies from college ultimately ended up.</p>\n\n<p>So, like any good UNM CS student, I got a job at Intel hacking C# tools for their engineers to use during testing.  It was fine, but I knew I could not work in a cube forever.</p>\n\n<p>Around that time, one of my buddies had the original iPhone and I was crazy jealous.  I think I had some silly Windows CE brick or a Palm Treo or something.  It was obvious that the iPhone was the “next big thing” and I took notice.  So I started developing web apps for the iPhone, as that was the primary way to get custom apps for the devices.  Apple even had a terrible (non mobile formatted) interface for exploring such web apps.</p>\n\n<p>I built <em>cool</em> things like a Weight Watchers Point Calculator (my wife’s idea) and Minesweeper and to my surprise made a couple bucks a day on ads.  This really fueled my excitement.  Then, Apple announced the official SDK.</p>\n\n<p><strong>An Aventure In iCodeBlog And Other NDA Violations </strong></p>\n\n<p>When Apple first released the SDK, the App Store didn’t exist yet.  All developers were forced under Apple’s NDA, stating that we weren’t able to discuss any aspect of the SDK on the web.  As you can imagine, this left very little resources available for learning how to actually do development.  There were no blogs, no books, and the only source of information was Apple’s documentation.  I saw this as a HUGE opportunity.</p>\n\n<p>I very quickly registered the domain icodeblog.com and setup WordPress.  This led to my very <a href=\"http://www.icodeblog.com/2008/07/22/icodeblog-launched/\">first post</a> in July of 2008. I had no idea what I was doing; it was my first blog ever, but I knew I would be able to learn more effectively if I was teaching others as I went along.</p>\n\n<p>Being a Java developer, I was comfortable reading documentation so I dug right in to the iOS docs.  I spent all of my free time (the time that wasn’t spent with my wife) learning and blogging.  I was violating the NDA by discussing it on the web, but my page views were growing every day.  Other blogs started to sprout up but I soon had the most popular iOS development blog on the web.  I had over 10K RSS subscribers one month after my blog launch.</p>\n\n<p>Things were really exciting, however, I had to start thinking about my future and how I was going to support my family.  Still being a bit narrow-minded with my career choices, I applied for a job at Lockheed Martin and got a position.  It was all set; I would graduate college in the spring and head to the “cube farm”.  Destined for a life of “here’s your input, give me this output”, TPS Reports, and other corporate stereotype jokes…</p>\n\n<p>That’s when I got my first iOS programming job offer…</p>\n\n<p><strong>Enter RightSprite</strong></p>\n\n<p>As you can imagine, the popularity of iCodeBlog did not go unnoticed.  I received job inquiries quite often and one them happened to be from a guy who lived in Ireland named Jonathan.  He was a wealthy American entrepreneur who had added a mobile offering to his already successful rails consultancy called RightSprite.  However, he started his business by outsourcing to the Ukraine, which yielded fairly poor results.</p>\n\n<p>So, in the winter of 2008 I received an email that they wanted to purchase iCodeBlog and give me a job replacing their outsourced team.  He also happened to have an employee in NM named Josh.  Josh and I met at a “hip” food place that I had never heard of and I was blown away that this was considered “business”.  Needless to say, I was excited.</p>\n\n<p>So here I am, about to graduate with a perfect job lined up, and I get an offer like this.  I had no idea what to do.  The idea of working remote was foreign to me and had never even crossed my mind.  People can actually do that?  I can work in my pajamas??</p>\n\n<p>So I decided to take a risk, sell him my blog, and accept the job offer.  I was terrified-especially when he told me that my first check was coming out of his personal bank account and that was why it was late.  Little did I know, this would be one of the best career decisions I could ever make…</p>\n\n<p><strong>Build, Hire, Repeat</strong></p>\n\n<p>I graduated from college and my career was in full swing.  I was the sole developer at a consultancy that had more mobile work than it knew what to do with.  My family had no idea what I did.  They though I was a drug dealer or something just as lucrative.  At one point, my grandma asked me, “When are you going to get a <em>real</em> job like your cousin Michael (he works for the city)”.  I could’t quite believe this was a legitimate job myself.</p>\n\n<p>Things started to get very exciting.  Jonathan asked me to help hire our next employee.  Luckily, a guy by the name of Collin reached out to me and asked if he could guest blog on iCodeBlog.  A few tutorials later and we offered him a job.</p>\n\n<p>RightsSprite continued to scale up and I helped hire quite a few new developers.  They eventually moved to a physical building in Portland, Oregon while I still worked remotely from NM.  The team continued to grow.</p>\n\n<p><strong>A Book Deal</strong></p>\n\n<p>Even though I didn’t own iCodeBlog anymore, I still contributed to it from time to time.  This lead to me being contacted by a few publishing companies with book offers.  A book offer?  It doesn’t sound that cool now, but in 2009, when there weren’t many iOS development books, it sounded incredible.</p>\n\n<p>I decided to go with Manning Publishing and I updated their iPhone development book from web app-centric to SDK-centric.  It amazed me that I struggled to write four paragraph essays in high school but I was now writing a four hundred page book with ease.</p>\n\n<p>The book did fairly well and sold around 10,000 copies.  Unfortunately, when you are an author of a tech book, that amounts to just about nothing in profit.  As you can imagine, I had little motivation to do the update the next year when Apple updated the SDK.</p>\n\n<p><strong>A New Sheriff In Town</strong></p>\n\n<p>Shortly after moving the offices to Portland, the owner sold the company and we had a new president and CEO.  He ran things a bit differently but ultimately things were cruising forward.  Our team continued to expand and eventually I hired our first Android developers.</p>\n\n<p>In December of 2011, I was promoted to the Director of Mobile Engineering.  It was a fancy title and I was entirely proud to hand out business cards with that printed on them.  I had helped build the team up to around sixteen mobile developers and it was now my job to manage them, as well as work closely with sales to land larger contracts.</p>\n\n<p>2012 was a great year of working on cool projects including the Food Network and Google Fiber TV.  I got to attend WWDC and spend a few weeks on Google’s campuses.</p>\n\n<p><strong>Things Get Shaken Up</strong></p>\n\n<p>Little did I know, there was some unrest in the company with the higher-up managers.  One day, there was a company memo that the three people who were higher ranked than myself had all left.  There were rumors as to why they left, but no one really had the true story.  This caused a stir in the company and a few more developers began to follow suit.</p>\n\n<p>This, of course, led to some company restructuring which put me right at the top with one other team member.  I was now one of the highest paid people in the company and solely in charge of the entire mobile team.</p>\n\n<p>I thought everything was perfect until one day in December of 2012, I received the following message when I logged into Gmail:</p>\n\n<blockquote>\n  <p>Your account has been suspended, please contact the administrator.</p>\n</blockquote>\n\n<p>This made me considerably suspicious.  I knew there was a lot of restructuring in the recent history and I immediately wondered if I was next on the chopping block.  I was logged into Linked In at the time and noticed the company owner was the last person to view my profile.  “He suspects me of looking for other jobs and is checking up on me”, I thought.</p>\n\n<p>That’s when I received a message on Skype from him.  It said:</p>\n\n<blockquote>\n  <p>Brandon, do you have time to talk?</p>\n</blockquote>\n\n<p>My heart jumped into my throat.  I knew what was coming next.  He was soon up on video chat and proceeded to tell me that the company was undergoing some restructuring and my position has been eliminated.  “Eliminated?” I thought.  And then I asked him what that meant for me.  He repeated the sentence again, said thanks, and hung up.  That was it; I no longer had a job.</p>\n\n<p>My “secure” job that I had been working at for four years disappeared in a matter of seconds with very little “real” explanation.  I was speechless.</p>\n\n<p><strong>Taking The Plunge</strong></p>\n\n<p>After getting “let go”, I took the rest of the day off and went out with my family (wife and two kids).  We were shocked, but I knew what I had to do.  It was what I had been dreaming of doing for quite some time.</p>\n\n<p>Armed with the knowledge of the entire software pipeline-from sales, to development, to maintenance-I hit the ground running the very next day in search of my first contract.</p>\n\n<p>I wrote <a href=\"http://brandontreb.com/what-i-learned-in-my-first-month-being-a-contract-ios-developer\">this blog post</a> documenting that very first month.</p>\n\n<p> </p>\n\n<p><strong>Takeaway</strong></p>\n\n<p>It has been a little over a year since I’ve had a “secure” job.  I put that word in quotes because I now believe the only way to have a secure career is to make one for yourself.  You could be let go at any time, for any reason.</p>\n\n<p>I was very fortunate to have a first job that allowed me to learn the needed skills to do what I’m passionate about; building consumer facing apps that get used by thousands of people.  If you want to do the same, I would encourage you to find a job that lets you explore all of the aspects of consulting to find out if it’s right for you.</p>\n\n<p>Sometimes I wonder why everyone is not a consultant.  It feels so free to be able to hack outside on a nice day or go sailing with my buddies on a random Wednesday.  But that’s just one side of the coin.  Other days, I wonder why I am even doing it.  I often wish I had a simple job with a well-defined task where once I got “off work”, I could go home and not think about it again until the next day but I don’t have that luxury.  There are real risks and stresses involved with working for yourself so I urge you to weigh them out before taking the plunge.</p>\n\n<p>I have received so many good questions through my last few posts about consulting.  They have inspired me and I intend on taking this year to diligently blog about topics such as finding clients, health insurance, contracts, etc.</p>\n\n<p>So please share and subscribe; I hope to help you on your journey to becoming free of your corporate chains.</p>\n\n<p><em>This post is part of a series about becoming and independent software consultant.  I am participating in this series with my good friend Josh. <a href=\"http://joshuastephenson.com/2014/02/06/on-becoming-an-independent-software-consultant/\" target=\"_blank\">You can read his take on this post here</a>.</em></p>\n\n<div style=\"\">\n  <a href=\"http://twitter.com/share\" class=\"twitter-share-button\" data-count=\"horizontal\" data-text=\"Becoming A Software Consultant: My Backstory \" data-url=\"http://brandontreb.com/becoming-software-consultant-backstory\" data-via=\"brandontreb\" data-related=\"brandontreb:\">Tweet</a>\n</div>\n\n",
			"date_published": "2014-01-31T00:00:00-07:00",
			"url": "http://localhost:4000/becoming-software-consultant-backstory"
		},
		
		{
			"id": "learned-first-year-ios-consulting",
      
			"title": "What I Learned In My First Year Of iOS Consulting",
			
			"content_html": "<p>Wow, I can’t believe it has already been a full year since I struck it out on my own.  Last year, I <a href=\"http://brandontreb.com/what-i-learned-in-my-first-month-being-a-contract-ios-developer\">published a post</a> after my first month on doing contract iOS development.  Needless to say, I have grown and learned quite a bit over the past year and I wanted to share some of those experiences.</p>\n\n<h3 id=\"income\">Income</h3>\n\n<p>While I won’t share exact numbers, I left my 6 figure/year job to pursue the indie/consulting life.  During the course of the year, I was able to amass 40% more income in 2013 than I had at my previous position.</p>\n\n<p>In addition to that, I had the time to launch a couple iOS applications and thus upping my Apple income by about 20% this year.</p>\n\n<h3 id=\"network-network-network\">Network Network Network</h3>\n\n<p>I would say spending time networking and meeting people is just as important as being able to write code if you want to be successful on your own.  Through out the year, I dedicated at least five to ten hours a week just meeting with people, talking on the phone, and making new connections.</p>\n\n<p>Often times, I would get contract opportunities that I knew for sure that I wasn’t going to take; either because I didn’t love the project, or (more often than not) because I didn’t have the bandwidth to take them on.  However, rather than just writing the client back “<em>I don’t have time</em>“, I would take the call (or meeting in town), make the connection, and even listen to details about the contract.</p>\n\n<p>My wife would tell me to stop wasting my time and that those hours would be better spent on project work that actually made money.  However, these contacts are arguably <strong>more</strong> valuable than the hours “lost”.  In many situations, I have reached out to those potential clients weeks or months later once I hired a new developer and was then able signed a contract.  If I had declined the meeting to begin with, they probably wouldn’t have been as inclined to work with me so readily.</p>\n\n<h3 id=\"subcontractors\"><strong>Subcontractors</strong></h3>\n\n<p>Subcontracting has been a mixed bag for me.  <span style=\"line-height: 1.714285714; font-size: 1rem;\">It seems to be the only (safe-ish) way to expand your business as a consultant, other than hiring full time developers.  So, if you want to be able to work less yourself (which is almost never the case) or increase your companies revenue, you need to hire out.  </span></p>\n\n<p>Once I found the right people, subcontracting was a dream.  I was able to reach more clients, still deliver the same value in the work, and achieve the client’s goals, all while expanding my business.</p>\n\n<p>The main challenge I have had is deciding whether to hire subcontractors from here in the states or “offshore”.  They both have their benefits and complications. Here are some I have found:</p>\n\n<p><strong>Benefits of hiring in the states:</strong></p>\n\n<ul>\n  <li>Communication – Most of the time their timezones are close enough that one of you is not inconvenienced to communicate in real time.</li>\n  <li>Trust From Clients – Some clients still have some issues with “offshore”, especially because many of them have tried their hand at the ODesk lottery and have lost.  So, saying you have US based team members sometimes makes them more comfortable. It’s unfortunate, but I have seen it to be true in some cases.</li>\n  <li>Colleagues – Often times you already know or have worked with these guys since starting with acquaintances/friends is a good place to look for developers.</li>\n</ul>\n\n<p><strong>Complications hiring in the states</strong></p>\n\n<ul>\n  <li>Cost – US devs are expensive.  Most of the time they have full time jobs and want to do consulting on the side.  So it is important that they get paid more to do contract work than their day job pays.</li>\n  <li>Colleagues – This is on the negative list as well because hiring people you know can get weird if things go awry.</li>\n</ul>\n\n<p><strong>Benefit of Offshore developers </strong></p>\n\n<ul>\n  <li>Cost – I put this here, however that doesn’t mean I hire “cheap” developers.  Honestly, if you are not paying a contractor well, you are either under paying him and should give him a raise OR he shouldn’t be working for you as he’s probably too junior.</li>\n  <li>Perspective – I have some incredible developers in other countries that have taught me quite a bit whether it’s about development, process, culture, or even my own code.  It’s a great opportunity to learn.</li>\n</ul>\n\n<p><strong>Problems with Offshore developers </strong></p>\n\n<ul>\n  <li>Location – Timezone issues <em>can</em> be a problem if you let them.  For example, I have a developer who lives in a completely different timezone than my own.  However, he does a fantastic job of being available when he is needed.  I have had other instances where it was very challenging to reach my developer in an event where I needed information on short notice.</li>\n  <li>Vetting Process – Finding developers is a little more tricky.  With devs in the states, you can just head to a local meet up or conference, but finding GOOD “offshore” devs is a little trickier.  I have lucked out a few times, but for the most part it’s a bit more work.  I would suggest spending a little of your own money to adequately search and vet each candidate.</li>\n  <li>Language – While doing iOS development, you may need your client and your developer to communicate with one another.  That being said, it’s vital to find a developer who <em>you</em> can understand and who can understand you in order to make communication possible.</li>\n</ul>\n\n<h3 id=\"hiring-an-assistant\">Hiring An Assistant</h3>\n\n<p>Taking a page from Tim Ferris’ <em>4 Hour Work Week</em>, I decided to hire an assistant.  Ferris suggests “virtual”, however, I have hired one locally (she’ll be proofreading this post 😉 ).  I think it’s one of the best decisions I have made as a business owner.  Here is just a short list of things she handles for me:</p>\n\n<ul>\n  <li>Contracts</li>\n  <li>Invoicing</li>\n  <li>Payments of contractors</li>\n  <li>Research</li>\n  <li>Phone calls</li>\n  <li>Personal issues (like returns, purchasing equipment, etc.)</li>\n</ul>\n\n<p>Even if she saves me two hours per week, she has paid for herself, and believe me, she saves me much more than that.</p>\n\n<h3 id=\"never-decline-a-contract\">Never Decline A Contract</h3>\n\n<p>I mentioned this earlier in the post, but I want to reiterate it here.  I seldom tell clients “no” and I really feel that it has worked out to my benefit.  At the very least, I hear them out and add them as a contact to keep in mind for the future.</p>\n\n<p>What I generally do when I can’t take on a client is I will give them an estimate of when myself or a member of my team will be available.  That way, if they are okay with the timeline, I can keep the pipeline open.  If not, there is no harm done.  Also, if I hire another developer before the time I said I was available, sometimes the client will still have the need and I am able to fill it.</p>\n\n<p>If I absolutely don’t have time or don’t want a particular contract, I will refer the client out to other dev shops.  I don’t look at this as competition, but rather opportunity as I would hope they would do the same for me one day.  As an added bonus, some of them have a referral fee so you can at least profit from pairing the client up.</p>\n\n<h3 id=\"taxes\">Taxes</h3>\n\n<p>I have found out that taxes are less fun when you are self-employed than when you are employed by a business.  Luckily my wife is MUCH better at money management than I am, so she set up a separate tax account where roughly 40% of our income would go.</p>\n\n<p>One of the other good decisions I made besides hiring an assistant was hiring a CPA.  She has saved me countless hours and fees and is worth her weight in gold.</p>\n\n<p>Hire a CPA from day one; you will never regret it.</p>\n\n<h3 id=\"family\">Family</h3>\n\n<p>I know this is a “business” related post, but I have to mention this.  Having a wife and kids, I am very much a family man.  Working for myself has been such a blessing since I have been able to spend considerably more time with my family than when I was employed by someone else.</p>\n\n<p>For example, if it’s a nice summer day and the family decides to head to the zoo, I can just go without asking a boss for time off or taking PTO.  I simply work in the evening or more hours the next day to recoup the time.  Personal time management is key to be able to have this kind of freedom.</p>\n\n<h3 id=\"summary\">Summary</h3>\n\n<p>Overall, 2013 was an incredible year.  While I did make mistakes (a ton), I gained so much knowledge and had a blast doing so.  Going solo isn’t for everyone (some days I wonder why everyone** isn’t** doing it, and others I wonder why I <strong>am</strong>), but it’s been one of the most exciting experiences of my life.</p>\n\n<p>I look forward to what 2014 brings and seeing how I can continue to grow my consultancy.</p>\n\n<p>Happy New Year and Happy Hacking!</p>\n\n<div style=\"\">\n  <a href=\"http://twitter.com/share\" class=\"twitter-share-button\" data-count=\"horizontal\" data-text=\"What I Learned In My First Year Of iOS Consulting\" data-url=\"http://brandontreb.com/learned-first-year-ios-consulting\" data-via=\"brandontreb\" data-related=\"brandontreb:\">Tweet</a>\n</div>\n\n",
			"date_published": "2014-01-01T00:00:00-07:00",
			"url": "http://localhost:4000/learned-first-year-ios-consulting"
		},
		
		{
			"id": "the-top-5-places-to-find-good-developerscontractors-to-work-on-your-projects",
      
			"title": "The Top 5 Places To Find Good Software Developers/Contractors",
			
			"content_html": "<p>One thing I am often asked is “Where can I find good developers/contractors/subcontractors?” While I have found talent many different ways, I wanted to share my top 5 with you.</p>\n\n<p>This post should be useful to you if you have a project and are looking to find a developer OR are a developer looking to subcontract some of your work.  I am sharing these based solely on my experiences with them and hope you find value in this list.</p>\n\n<h3 id=\"1-local-meetups\">1. Local Meetups</h3>\n\n<p>Local meet ups are the absolute best place in my opinion to find developers.  Almost every city in the nation has some sort of group meeting on a regular bases for a given focus of development.  You should have no problems finding a rails meetup group, iOS, Android, etc…</p>\n\n<p>I would suggest finding out about such meetups in your area by Googling phrases such as “[your area] iOS meetup (sub iOS for rails, python, etc…).  I regularly attend a “Cocoa Heads” group full of incredibly smart and capable mobile developers all willing to work on projects.</p>\n\n<p>These types of groups are always excited to have clients come in and pitch their ideas.  One piece of advice though, don’t go in to these groups and start with “I have a great idea and I will give you a percentage of the company in exchange for development”. They will stop listening immediately.</p>\n\n<h3 id=\"2-popular-developersmailing-lists\">2. Popular Developers/Mailing Lists</h3>\n\n<p>This one is going to require a bit of work and research on your part, but I will get you started.  Around the internet, there are a few of what I call “celebrity developers”.  These are generally guys who have made a name for themselves and who are established as experts in their space.</p>\n\n<p>While many of them are not taking on contract work themselves, they may or may not have a mailing list of interested contractors.  One such person that does exactly this is <a href=\"http://raywenderlich.com\">Ray Wenderlich</a> and I happen to receive emails on his contractor list.</p>\n\n<p>Even if these developers don’t have lists, they generally have plenty of connections to point you in the right direction.  Like I said, this method isn’t easy, but it can definitely have one of the biggest payoffs in terms of quality developers.</p>\n\n<h3 id=\"3-specialize-project-sites\">3. Specialize Project Sites</h3>\n\n<p>As of late, quite a few interesting sites have been popping up that have solved a fundamental issue when it comes to pairing developers with projects. The problems are 1. it’s hard to find good developers and 2. it’s hard to find clients with realistic cost expectations. That’s why ODesk exists 😉</p>\n\n<p>The first of these sites that I have found is <a href=\"http://ooomf.com\">OOOMF</a>.  OOOMF is relatively new and you must be reviewed and accepted by their team in order to be a part of it.  It’s basically a private network for pairing developers with projects and it supports all different project types (mobile, web, design, etc…).</p>\n\n<p>Project owners can put their project up with a relative budget and developers can “apply”.  The process then moves forward with communication between the client and the developers until a price and scope have been reached.</p>\n\n<p>There is an additional overhead of 15% for using this service, but I think it’s well worth it.</p>\n\n<p>Another one of these sites that is more mobile centric is<a href=\"http://apphappening.com\"> http://apphappening.com</a>.  This site is very new and I have only just begun to use it.  I should have a better review of them shortly.</p>\n\n<h3 id=\"4-twitter-and-appnet\">4. Twitter and App.net</h3>\n\n<p>Twitter and app.net are definitely the preferred social network of serious developers.  I would steer clear of Facebook and Linked in as this is generally where the recruiters hang out. Your message will most likely get dismissed as spam.</p>\n\n<p>I’d suggest searching Twitter/App.net for the keywords of your project (iOS developer, rails, etc…) and find the folks with a ton of follows and a very small following to follower ratio. You will know them right away.  Also, most of their blogs come up first in Google for many related keywords.</p>\n\n<h3 id=\"5-developer-conferences\">5. Developer Conferences</h3>\n\n<p>This one might cost you a bit of money, but is definitely well worth it.  There are conferences for every focus of software development and they occur all throughout the year.  These conferences generally have a HUGE percentage of professional developers who are just as eager to work on a project as you are to have them.</p>\n\n<p>One of my favorite iOS conferences is <a href=\"http://360idev.com\">360iDev</a>. It’s very indie-centric and offers an incredible community of iOS developers of all abilities.  If you are looking to get a mobile project done, I strongly urge you to attend.  While I can’t speak for conferences in other areas(web, etc..), I would really love some suggestions in the comments of this post if you are up for it!</p>\n\n<h3 id=\"6-bonus--right-here\">6. Bonus – Right Here</h3>\n\n<p>Shameless plug time.  If you are looking for professional mobile app (iOS or Android), I have a team of developers and am always looking to work on new and exciting projects.  If you want to hear more about it head over to my <a href=\"http://pixegon.com/\">Hire Us</a> page or shoot me an email brandon @ pixegon [dot] com.</p>\n\n<h3 id=\"conclusion\">Conclusion</h3>\n\n<p>Whether you are a person/company looking to hire developers or a developer looking to hire contractors, I hope you have found this post useful.  Your feedback in the comments is greatly appreciated.  Best of luck with your search!</p>\n\n<div style=\"\">\n  <a href=\"http://twitter.com/share\" class=\"twitter-share-button\" data-count=\"horizontal\" data-text=\"The Top 5 Places To Find Good Software Developers/Contractors\" data-url=\"http://brandontreb.com/the-top-5-places-to-find-good-developerscontractors-to-work-on-your-projects\" data-via=\"brandontreb\" data-related=\"brandontreb:\">Tweet</a>\n</div>\n\n",
			"date_published": "2013-08-20T00:00:00-06:00",
			"url": "http://localhost:4000/the-top-5-places-to-find-good-developerscontractors-to-work-on-your-projects"
		},
		
		{
			"id": "iphone-programming-tutorial-creating-an-image-gallery-like-over-part-2",
      
			"title": "iPhone Programming Tutorial: Creating An Image Gallery Like Over &#8211; Part 2",
			
			"content_html": "<p><a href=\"http://brandontreb.com/wp-content/uploads/2013/08/Screen-Shot-2013-08-09-at-8.36.42-PM.png\"><img class=\"alignright\" alt=\"Screen Shot 2013-08-09 at 8.36.42 PM\" src=\"http://brandontreb.com/wp-content/uploads/2013/08/Screen-Shot-2013-08-09-at-8.36.42-PM.png\" width=\"225\" height=\"365\" /></a></p>\n\n<p> </p>\n\n<p>Welcome to the second part of my tutorial series “<strong>Creating An Image Gallery Like Over”.</strong>  In this part of the tutorial, you will learn how to actually display the photos in the UICollectionView as well as give the user the ability to take photos with their camera.</p>\n\n<p>If you haven’t already done so, please go back and<a href=\"http://brandontreb.com/iphone-programming-tutorial-creating-an-image-gallery-like-over-part-1\"> complete part 1</a>.</p>\n\n<h3 id=\"1-custom-uicollectionviewcell\">1. Custom UICollectionViewCell</h3>\n\n<p>Start by creating a new subclass of <strong>UICollectionViewCell</strong> and naming it <strong>PhotoCell.  </strong>Now, open up PhotoCell.h and add the following code:</p>\n\n<div class=\"wp_syntax\">\n  <table>\n    <tr>\n      <td class=\"code\">\n        <pre class=\"objc\" style=\"font-family:monospace;\"><span style=\"color: #6e371a;\">#import &lt;AssetsLibrary/AssetsLibrary.h&gt;</span>\n&nbsp;\n<span style=\"color: #a61390;\">@interface</span> PhotoCell <span style=\"color: #002200;\">:</span> UICollectionViewCell\n<span style=\"color: #a61390;\">@property</span><span style=\"color: #002200;\">&#40;</span>nonatomic, strong<span style=\"color: #002200;\">&#41;</span> ALAsset <span style=\"color: #002200;\">*</span>asset;\n<span style=\"color: #a61390;\">@end</span></pre>\n      </td>\n    </tr>\n  </table>\n</div>\n\n<p>Now, open PhotoCell.m and add the following code:</p>\n\n<div class=\"wp_syntax\">\n  <table>\n    <tr>\n      <td class=\"code\">\n        <pre class=\"objc\" style=\"font-family:monospace;\"><span style=\"color: #6e371a;\">#import \"PhotoCell.h\"</span>\n&nbsp;\n<span style=\"color: #a61390;\">@interface</span> PhotoCell <span style=\"color: #002200;\">&#40;</span><span style=\"color: #002200;\">&#41;</span>\n<span style=\"color: #11740a; font-style: italic;\">// 1</span>\n<span style=\"color: #a61390;\">@property</span><span style=\"color: #002200;\">&#40;</span>nonatomic, weak<span style=\"color: #002200;\">&#41;</span> IBOutlet UIImageView <span style=\"color: #002200;\">*</span>photoImageView;\n<span style=\"color: #a61390;\">@end</span>\n&nbsp;\n<span style=\"color: #a61390;\">@implementation</span> PhotoCell\n<span style=\"color: #002200;\">-</span> <span style=\"color: #002200;\">&#40;</span><span style=\"color: #a61390;\">void</span><span style=\"color: #002200;\">&#41;</span> setAsset<span style=\"color: #002200;\">:</span><span style=\"color: #002200;\">&#40;</span>ALAsset <span style=\"color: #002200;\">*</span><span style=\"color: #002200;\">&#41;</span>asset\n<span style=\"color: #002200;\">&#123;</span>\n    <span style=\"color: #11740a; font-style: italic;\">// 2</span>\n    _asset <span style=\"color: #002200;\">=</span> asset;\n    self.photoImageView.image <span style=\"color: #002200;\">=</span> <span style=\"color: #002200;\">&#91;</span>UIImage imageWithCGImage<span style=\"color: #002200;\">:</span><span style=\"color: #002200;\">&#91;</span>asset thumbnail<span style=\"color: #002200;\">&#93;</span><span style=\"color: #002200;\">&#93;</span>;\n<span style=\"color: #002200;\">&#125;</span>\n<span style=\"color: #a61390;\">@end</span></pre>\n      </td>\n    </tr>\n  </table>\n</div>\n\n<ol>\n  <li>This is an <strong>IBOutlet </strong>to a <strong>UIImageView</strong> that we will create inside of the Storyboard</li>\n  <li>We overwrite the setter method for the asset in order to convert the asset’s thumbnail into a UIImage and set it to the contents of the UIImageView</li>\n</ol>\n\n<p>Now that we have the custom cell created, we need to hook it up and create the UIImageView inside of Storyboard.  Open <strong>MainStoryboard.storyboard </strong>and click on the default <strong>UICollectionViewCell</strong> inside of your <strong>UICollectionView.</strong></p>\n\n<p>It might be tricky to see the cell as it has a white background and blends in, but it’s there.</p>\n\n<p><a href=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-24-at-6.43.38-PM.png\"><img alt=\"Screen Shot 2013-07-24 at 6.43.38 PM\" src=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-24-at-6.43.38-PM-300x281.png\" width=\"300\" height=\"281\" /></a></p>\n\n<p>Now, click on the <strong>Identity Inspector</strong> from the right side bar and change the class to <strong>PhotoCell.</strong>  This will inform interface builder that this object is of the type PhotoCell and let us hook up the photoImageView outlet.</p>\n\n<p><a href=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-24-at-6.46.35-PM.png\"><img alt=\"Screen Shot 2013-07-24 at 6.46.35 PM\" src=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-24-at-6.46.35-PM.png\" width=\"260\" height=\"70\" /></a></p>\n\n<p>Next, open the size inspector, change the size to <strong>Custom, </strong>the width to <strong>104 </strong>and the height to <strong>104.</strong>  This will give us nice sized images, with a good amount of padding between them.</p>\n\n<p><a href=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-24-at-6.49.51-PM.png\"><img alt=\"Screen Shot 2013-07-24 at 6.49.51 PM\" src=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-24-at-6.49.51-PM.png\" width=\"260\" height=\"105\" /></a></p>\n\n<p>The <strong>UICollectionView</strong> will overwrite these sizes, so we need to change it in one other location.  To ensure that the cells stay the correct size, click on the <strong>Collection View</strong> in left side bar and open it’s <strong>Size Inspector</strong>.  Then set the <strong>Cell Size</strong> width and height to 104.</p>\n\n<p><a href=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-24-at-7.07.14-PM.png\"><img alt=\"Screen Shot 2013-07-24 at 7.07.14 PM\" src=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-24-at-7.07.14-PM.png\" width=\"260\" height=\"81\" /></a></p>\n\n<p>The final step here is to drag a <strong>UIImageView</strong> on to your cell (scaling it to fit the entire cell size), and hook up the <strong>IBOutlet</strong> to the photoImageView. Do this by control-click and dragging from Photo Cell to the ImageView and selecting <strong>photoImageView</strong>.</p>\n\n<p><a href=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-24-at-6.52.32-PM.png\"><img alt=\"Screen Shot 2013-07-24 at 6.52.32 PM\" src=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-24-at-6.52.32-PM-300x147.png\" width=\"300\" height=\"147\" /></a></p>\n\n<p>If you build and run at this stage, nothing will be different.  That’s because we still need to tell the ViewController class about our new <strong>PhotoCell</strong>.  Open <strong>ViewController.m </strong>and import <strong>PhotoCell.h</strong>.</p>\n\n<div class=\"wp_syntax\">\n  <table>\n    <tr>\n      <td class=\"code\">\n        <pre class=\"objc\" style=\"font-family:monospace;\"><span style=\"color: #6e371a;\">#import \"PhotoCell.h\"</span></pre>\n      </td>\n    </tr>\n  </table>\n</div>\n\n<p>Now, head down to the <strong>collectionView:cellForItemAtIndexPath</strong> method and replace the contents of it with the following code:</p>\n\n<div class=\"wp_syntax\">\n  <table>\n    <tr>\n      <td class=\"code\">\n        <pre class=\"objc\" style=\"font-family:monospace;\"><span style=\"color: #002200;\">-</span> <span style=\"color: #002200;\">&#40;</span>UICollectionViewCell <span style=\"color: #002200;\">*</span><span style=\"color: #002200;\">&#41;</span> collectionView<span style=\"color: #002200;\">:</span><span style=\"color: #002200;\">&#40;</span>UICollectionView <span style=\"color: #002200;\">*</span><span style=\"color: #002200;\">&#41;</span>collectionView cellForItemAtIndexPath<span style=\"color: #002200;\">:</span><span style=\"color: #002200;\">&#40;</span><span style=\"color: #400080;\">NSIndexPath</span> <span style=\"color: #002200;\">*</span><span style=\"color: #002200;\">&#41;</span>indexPath\n<span style=\"color: #002200;\">&#123;</span>\n    PhotoCell <span style=\"color: #002200;\">*</span>cell <span style=\"color: #002200;\">=</span> <span style=\"color: #002200;\">&#40;</span>PhotoCell <span style=\"color: #002200;\">*</span><span style=\"color: #002200;\">&#41;</span><span style=\"color: #002200;\">&#91;</span>collectionView dequeueReusableCellWithReuseIdentifier<span style=\"color: #002200;\">:</span><span style=\"color: #bf1d1a;\">@</span><span style=\"color: #bf1d1a;\">\"PhotoCell\"</span> forIndexPath<span style=\"color: #002200;\">:</span>indexPath<span style=\"color: #002200;\">&#93;</span>;\n&nbsp;\n    ALAsset <span style=\"color: #002200;\">*</span>asset <span style=\"color: #002200;\">=</span> self.assets<span style=\"color: #002200;\">&#91;</span>indexPath.row<span style=\"color: #002200;\">&#93;</span>;\n    cell.asset <span style=\"color: #002200;\">=</span> asset;\n    cell.backgroundColor <span style=\"color: #002200;\">=</span> <span style=\"color: #002200;\">&#91;</span>UIColor redColor<span style=\"color: #002200;\">&#93;</span>;\n&nbsp;\n    <span style=\"color: #a61390;\">return</span> cell;\n<span style=\"color: #002200;\">&#125;</span></pre>\n      </td>\n    </tr>\n  </table>\n</div>\n\n<p>What’s changed here is, we are now telling the <strong>UICollectionView</strong> that the cell it’s returning is of the type <strong>PhotoCell</strong>. Also, we are fetching the <strong>ALAsset</strong> out of our array at each index and sending it to the cell so that it can display it’s thumbnail.</p>\n\n<p><strong>Build And Run!</strong></p>\n\n<p><a href=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-24-at-7.10.39-PM.png\"><img alt=\"Screen Shot 2013-07-24 at 7.10.39 PM\" src=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-24-at-7.10.39-PM-184x300.png\" width=\"184\" height=\"300\" /></a></p>\n\n<p>Whoohoo<strong>! </strong>You should now see your photos populating the **UICollectionView. Congratulations! &lt;/p&gt;</p>\n\n<p>&lt;/strong&gt;While, this is definitely cool, you might now be wondering “how do I select a photo?”.  Great question, and here is the solution.</p>\n\n<h3 id=\"2-selecting-photos\">2. Selecting Photos</h3>\n\n<p>Now that you have all of the groundwork in place, selecting photos from the collection could not be easier.  Open up <strong>ViewController.m</strong> and replace the <strong>collectionView:didSelectItemAtIndexPath </strong>method with the following code:</p>\n\n<div class=\"wp_syntax\">\n  <table>\n    <tr>\n      <td class=\"code\">\n        <pre class=\"objc\" style=\"font-family:monospace;\"><span style=\"color: #002200;\">-</span> <span style=\"color: #002200;\">&#40;</span><span style=\"color: #a61390;\">void</span><span style=\"color: #002200;\">&#41;</span> collectionView<span style=\"color: #002200;\">:</span><span style=\"color: #002200;\">&#40;</span>UICollectionView <span style=\"color: #002200;\">*</span><span style=\"color: #002200;\">&#41;</span>collectionView didSelectItemAtIndexPath<span style=\"color: #002200;\">:</span><span style=\"color: #002200;\">&#40;</span><span style=\"color: #400080;\">NSIndexPath</span> <span style=\"color: #002200;\">*</span><span style=\"color: #002200;\">&#41;</span>indexPath\n<span style=\"color: #002200;\">&#123;</span>\n    ALAsset <span style=\"color: #002200;\">*</span>asset <span style=\"color: #002200;\">=</span> self.assets<span style=\"color: #002200;\">&#91;</span>indexPath.row<span style=\"color: #002200;\">&#93;</span>;\n    ALAssetRepresentation <span style=\"color: #002200;\">*</span>defaultRep <span style=\"color: #002200;\">=</span> <span style=\"color: #002200;\">&#91;</span>asset defaultRepresentation<span style=\"color: #002200;\">&#93;</span>;\n    UIImage <span style=\"color: #002200;\">*</span>image <span style=\"color: #002200;\">=</span> <span style=\"color: #002200;\">&#91;</span>UIImage imageWithCGImage<span style=\"color: #002200;\">:</span><span style=\"color: #002200;\">&#91;</span>defaultRep fullScreenImage<span style=\"color: #002200;\">&#93;</span> scale<span style=\"color: #002200;\">:</span><span style=\"color: #002200;\">&#91;</span>defaultRep scale<span style=\"color: #002200;\">&#93;</span> orientation<span style=\"color: #002200;\">:</span><span style=\"color: #2400d9;\"></span><span style=\"color: #002200;\">&#93;</span>;\n    <span style=\"color: #11740a; font-style: italic;\">// Do something with the image</span>\n<span style=\"color: #002200;\">&#125;</span></pre>\n      </td>\n    </tr>\n  </table>\n</div>\n\n<p>This will get the selected asset and convert it to a UIImage. You are now free to use the UIImage how you want. Perhaps you create a protocol for this class and make a callback to a delegate OR maybe you add this to a UINavigationController stack and push a new view controller on to the stack containing this image. The sky is the limit!</p>\n\n<p>If you look at the Over app and back to your image gallery that you just created, you will notice something is still missing.  What if the user wants to take a photo or access other albums?  This is where Over adds a bar across the top of the interface with 2 buttons that fall back to the “default” style of fetching images if the user wants to take a photo or access a different photo album.  Let’s build this out now.</p>\n\n<h3 id=\"3-building-the-interface-to-take-photos-and-access-albums\">3. Building The Interface To Take Photos And Access Albums</h3>\n\n<p>Start by setting up the <strong>IBActions</strong> for theses buttons.  Open <strong>ViewController.m</strong> and add the following empty methods:</p>\n\n<div class=\"wp_syntax\">\n  <table>\n    <tr>\n      <td class=\"code\">\n        <pre class=\"objc\" style=\"font-family:monospace;\"><span style=\"color: #6e371a;\">#pragma mark - Actions</span>\n&nbsp;\n<span style=\"color: #002200;\">-</span> <span style=\"color: #002200;\">&#40;</span>IBAction<span style=\"color: #002200;\">&#41;</span>takePhotoButtonTapped<span style=\"color: #002200;\">:</span><span style=\"color: #002200;\">&#40;</span><span style=\"color: #a61390;\">id</span><span style=\"color: #002200;\">&#41;</span>sender\n<span style=\"color: #002200;\">&#123;</span>\n&nbsp;\n<span style=\"color: #002200;\">&#125;</span>\n&nbsp;\n<span style=\"color: #002200;\">-</span> <span style=\"color: #002200;\">&#40;</span>IBAction<span style=\"color: #002200;\">&#41;</span>albumsButtonTapped<span style=\"color: #002200;\">:</span><span style=\"color: #002200;\">&#40;</span><span style=\"color: #a61390;\">id</span><span style=\"color: #002200;\">&#41;</span>sender\n<span style=\"color: #002200;\">&#123;</span>\n&nbsp;\n<span style=\"color: #002200;\">&#125;</span></pre>\n      </td>\n    </tr>\n  </table>\n</div>\n\n<p>We don’t need to add the code yet since we still need to build the UI and hook up the <strong>IBOutlets</strong>. Now open <strong>MainStoryboard.storyboard </strong>and drag a <strong>UIView </strong>right on top of your <strong>UIView.</strong></p>\n\n<p>One issue you might run in to here is the view will want to become a subview of the collection view.  To combat this, drag the view outside of the collection view inside the left bar so the hierarchy will look like this:</p>\n\n<p><a href=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-25-at-12.35.06-PM.png\"><img alt=\"Screen Shot 2013-07-25 at 12.35.06 PM\" src=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-25-at-12.35.06-PM.png\" width=\"265\" height=\"162\" /></a></p>\n\n<p> </p>\n\n<p>One other “gotcha” is, you must ensure that the view is positioned <strong>below</strong> the collection view in this list, otherwise it won’t show above it on screen.</p>\n\n<p>Now, let’s manually size and position the view as Interface Building will make things hard on us if we want to position it over our collection view.</p>\n\n<p>Select the view and open the <strong>Size Inspector.</strong> Set the values as follows:</p>\n\n<p><a href=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-25-at-12.44.23-PM.png\"><img alt=\"Screen Shot 2013-07-25 at 12.44.23 PM\" src=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-25-at-12.44.23-PM.png\" width=\"260\" height=\"168\" /></a></p>\n\n<p> </p>\n\n<p>Again, remember this positioning is optimized for the iPhone 5. So make sure you are testing with that simulator or you won’t see this bar.</p>\n\n<p>After this, the bar still won’t be visible inside of Interface Builder.  We need to set the background color to black with some transparency.  Open the <strong>Attributes Inspector</strong> and click on the background color.  Then set the color to black with 80% opacity:</p>\n\n<p><a href=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-25-at-12.40.13-PM.png\"><img alt=\"Screen Shot 2013-07-25 at 12.40.13 PM\" src=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-25-at-12.40.13-PM-177x300.png\" width=\"177\" height=\"300\" /></a></p>\n\n<p> </p>\n\n<p>You should now see the bar positioned on the screen like this:</p>\n\n<p><a href=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-25-at-12.41.54-PM.png\"><img alt=\"Screen Shot 2013-07-25 at 12.41.54 PM\" src=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-25-at-12.41.54-PM-154x300.png\" width=\"154\" height=\"300\" /></a></p>\n\n<p> </p>\n\n<p>Now drag a <strong>UIButton </strong>on to the view you just created. There are a few things that must be done to style the button:</p>\n\n<ol>\n  <li>Position it at 0,0</li>\n  <li>Set the width to 160px and the height to 70x</li>\n  <li>Change the type to custom</li>\n  <li>Change the text to “Take Photo”</li>\n  <li>Change the font to “Helvetica Neue Condensed Black” size 20</li>\n  <li>Set the text color to white</li>\n</ol>\n\n<p>When you have completed these steps, the button should look like this:</p>\n\n<p><a href=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-25-at-12.47.26-PM.png\"><img alt=\"Screen Shot 2013-07-25 at 12.47.26 PM\" src=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-25-at-12.47.26-PM-300x213.png\" width=\"300\" height=\"213\" /></a></p>\n\n<p> </p>\n\n<p>Now, hook up the <strong>IBAction </strong>by opening the <strong>Connections Inspector</strong> and dragging from <strong>Touch Up Inside</strong> to the <strong>View Controller</strong> object and selecting t<strong>akePhotoButtonTapped:</strong></p>\n\n<p>Finally, duplicate this button (copy and paste), rename the title to “Albums”, move it next to the “Take Photo” button and hook its <strong>Touch Up Inside</strong> to <strong>albumsButtonTapped:</strong></p>\n\n<p>The final Interface should look like this:</p>\n\n<p><a href=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-25-at-12.51.25-PM.png\"><img alt=\"Screen Shot 2013-07-25 at 12.51.25 PM\" src=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-25-at-12.51.25-PM-300x221.png\" width=\"300\" height=\"221\" /></a></p>\n\n<p> </p>\n\n<p>Go ahead and do a <strong>Build and Run</strong> and this stage and marvel at your interface development prowess!</p>\n\n<h3 id=\"4-actually-taking-photos-and-accessing-albums\">4. Actually Taking Photos And Accessing Albums</h3>\n\n<p>The final step for this tutorial is to implement the code to bring up the camera as well as bring up the photo albums.  Let’s start with the camera.  Open <strong>ViewController.m</strong> and add the following code to the <strong>takePhotosButtonTapped:</strong> method:</p>\n\n<div class=\"wp_syntax\">\n  <table>\n    <tr>\n      <td class=\"code\">\n        <pre class=\"objc\" style=\"font-family:monospace;\"><span style=\"color: #002200;\">-</span> <span style=\"color: #002200;\">&#40;</span>IBAction<span style=\"color: #002200;\">&#41;</span>takePhotoButtonTapped<span style=\"color: #002200;\">:</span><span style=\"color: #002200;\">&#40;</span><span style=\"color: #a61390;\">id</span><span style=\"color: #002200;\">&#41;</span>sender\n<span style=\"color: #002200;\">&#123;</span>\n    <span style=\"color: #a61390;\">if</span> <span style=\"color: #002200;\">&#40;</span><span style=\"color: #002200;\">&#40;</span><span style=\"color: #002200;\">&#91;</span>UIImagePickerController isSourceTypeAvailable<span style=\"color: #002200;\">:</span>\n          UIImagePickerControllerSourceTypeCamera<span style=\"color: #002200;\">&#93;</span> <span style=\"color: #002200;\">==</span> <span style=\"color: #a61390;\">NO</span><span style=\"color: #002200;\">&#41;</span><span style=\"color: #002200;\">&#41;</span>\n        <span style=\"color: #a61390;\">return</span>; <span style=\"color: #11740a; font-style: italic;\">// 1</span>\n&nbsp;\n    <span style=\"color: #11740a; font-style: italic;\">// 2</span>\n    UIImagePickerController <span style=\"color: #002200;\">*</span>mediaUI <span style=\"color: #002200;\">=</span> <span style=\"color: #002200;\">&#91;</span><span style=\"color: #002200;\">&#91;</span>UIImagePickerController alloc<span style=\"color: #002200;\">&#93;</span> init<span style=\"color: #002200;\">&#93;</span>;\n    mediaUI.sourceType <span style=\"color: #002200;\">=</span> UIImagePickerControllerSourceTypeCamera;\n    mediaUI.allowsEditing <span style=\"color: #002200;\">=</span> <span style=\"color: #a61390;\">NO</span>;\n    mediaUI.delegate <span style=\"color: #002200;\">=</span> self;\n    <span style=\"color: #11740a; font-style: italic;\">// 3</span>\n    <span style=\"color: #002200;\">&#91;</span>self presentViewController<span style=\"color: #002200;\">:</span>mediaUI animated<span style=\"color: #002200;\">:</span><span style=\"color: #a61390;\">YES</span> completion<span style=\"color: #002200;\">:</span><span style=\"color: #a61390;\">nil</span><span style=\"color: #002200;\">&#93;</span>;\n<span style=\"color: #002200;\">&#125;</span></pre>\n      </td>\n    </tr>\n  </table>\n</div>\n\n<ol>\n  <li>Makes sure that the photo library is available.  If the user declines photo access, this will be the case.</li>\n  <li>Create the <strong>UIImagePickerController</strong> and set its source type to <strong>UIImagePickerControllerSourceTypeCamera</strong>.  This lets the media picker know to use the camera and not the image library.</li>\n  <li>Finally, present the view controller modally</li>\n</ol>\n\n<p>The method to bring up the photo albums is almost identical to the method above.  Add the following code to the <strong>albumsButtonTapped:</strong> method.</p>\n\n<div class=\"wp_syntax\">\n  <table>\n    <tr>\n      <td class=\"code\">\n        <pre class=\"objc\" style=\"font-family:monospace;\"><span style=\"color: #002200;\">-</span> <span style=\"color: #002200;\">&#40;</span>IBAction<span style=\"color: #002200;\">&#41;</span>albumsButtonTapped<span style=\"color: #002200;\">:</span><span style=\"color: #002200;\">&#40;</span><span style=\"color: #a61390;\">id</span><span style=\"color: #002200;\">&#41;</span>sender\n<span style=\"color: #002200;\">&#123;</span>\n    <span style=\"color: #a61390;\">if</span> <span style=\"color: #002200;\">&#40;</span><span style=\"color: #002200;\">&#40;</span><span style=\"color: #002200;\">&#91;</span>UIImagePickerController isSourceTypeAvailable<span style=\"color: #002200;\">:</span>\n          UIImagePickerControllerSourceTypePhotoLibrary<span style=\"color: #002200;\">&#93;</span> <span style=\"color: #002200;\">==</span> <span style=\"color: #a61390;\">NO</span><span style=\"color: #002200;\">&#41;</span><span style=\"color: #002200;\">&#41;</span>\n        <span style=\"color: #a61390;\">return</span>;\n&nbsp;\n    UIImagePickerController <span style=\"color: #002200;\">*</span>mediaUI <span style=\"color: #002200;\">=</span> <span style=\"color: #002200;\">&#91;</span><span style=\"color: #002200;\">&#91;</span>UIImagePickerController alloc<span style=\"color: #002200;\">&#93;</span> init<span style=\"color: #002200;\">&#93;</span>;\n    mediaUI.sourceType <span style=\"color: #002200;\">=</span> UIImagePickerControllerSourceTypePhotoLibrary;    \n    mediaUI.allowsEditing <span style=\"color: #002200;\">=</span> <span style=\"color: #a61390;\">NO</span>;\n    mediaUI.delegate <span style=\"color: #002200;\">=</span> self;\n    <span style=\"color: #002200;\">&#91;</span>self presentViewController<span style=\"color: #002200;\">:</span>mediaUI animated<span style=\"color: #002200;\">:</span><span style=\"color: #a61390;\">YES</span> completion<span style=\"color: #002200;\">:</span><span style=\"color: #a61390;\">nil</span><span style=\"color: #002200;\">&#93;</span>;\n<span style=\"color: #002200;\">&#125;</span></pre>\n      </td>\n    </tr>\n  </table>\n</div>\n\n<p>As I said before, this method is almost identical with the only difference being, we are using <strong>UIImagePickerControllerSourceTypePhotoLibrary </strong>to open up the photo albums.</p>\n\n<p><strong>Build and Run</strong> and tap the “Take Photo” button. Make sure you are testing on the device at this stage or nothing will happen since the simulator doesn’t have a camera.  You can however test the “Albums” button assuming you have some photos in your photo library.</p>\n\n<p>Now that you are able to pick a photo, you need to be able to access the photo that was selected or taken.  To do this implement the following delegate method for <strong>UIImagePickerController.</strong></p>\n\n<div class=\"wp_syntax\">\n  <table>\n    <tr>\n      <td class=\"code\">\n        <pre class=\"objc\" style=\"font-family:monospace;\"><span style=\"color: #6e371a;\">#pragma mark - image picker delegate</span>\n&nbsp;\n<span style=\"color: #002200;\">-</span> <span style=\"color: #002200;\">&#40;</span><span style=\"color: #a61390;\">void</span><span style=\"color: #002200;\">&#41;</span> imagePickerController<span style=\"color: #002200;\">:</span><span style=\"color: #002200;\">&#40;</span>UIImagePickerController <span style=\"color: #002200;\">*</span><span style=\"color: #002200;\">&#41;</span>picker didFinishPickingMediaWithInfo<span style=\"color: #002200;\">:</span><span style=\"color: #002200;\">&#40;</span><span style=\"color: #400080;\">NSDictionary</span> <span style=\"color: #002200;\">*</span><span style=\"color: #002200;\">&#41;</span>info\n<span style=\"color: #002200;\">&#123;</span>\n    UIImage <span style=\"color: #002200;\">*</span>image <span style=\"color: #002200;\">=</span> <span style=\"color: #002200;\">&#40;</span>UIImage <span style=\"color: #002200;\">*</span><span style=\"color: #002200;\">&#41;</span> <span style=\"color: #002200;\">&#91;</span>info objectForKey<span style=\"color: #002200;\">:</span>\n                                          UIImagePickerControllerOriginalImage<span style=\"color: #002200;\">&#93;</span>;    \n    <span style=\"color: #002200;\">&#91;</span>self dismissViewControllerAnimated<span style=\"color: #002200;\">:</span><span style=\"color: #a61390;\">YES</span> completion<span style=\"color: #002200;\">:^</span><span style=\"color: #002200;\">&#123;</span>\n        <span style=\"color: #11740a; font-style: italic;\">// Do something with the image</span>\n    <span style=\"color: #002200;\">&#125;</span><span style=\"color: #002200;\">&#93;</span>;\n<span style=\"color: #002200;\">&#125;</span></pre>\n      </td>\n    </tr>\n  </table>\n</div>\n\n<p>This method fetches the selected (or taken) image and stores. It then dismisses the camera or photo albums allowing you to do whatever is needed with the image.</p>\n\n<h3 id=\"5-next-steps\">5. Next Steps</h3>\n\n<p>By now, you should have learned how to use the <strong>ALAssets </strong>library to interact with a user’s photos and use them to build a custom interface. You also learned how to use a <strong>UICollectionView</strong> to display a grid of photos.</p>\n\n<p>With this knowledge in hand, you should now be able to make much more interesting photo selection interfaces than the default one Apple has to offer.  Other apps like Google+ and Instagram both have very slick photo pickers and I hope this tutorial has your gears going thinking about other interesting photo selection interfaces.</p>\n\n<p>You can download the source from this tutorial on <a href=\"https://github.com/brandontreb/OverPicker\">GitHub</a></p>\n\n<p>Feel free to leave a comment if you have any questions. Happy Hacking!</p>\n\n<p> </p>\n\n<div style=\"\">\n  <a href=\"http://twitter.com/share\" class=\"twitter-share-button\" data-count=\"horizontal\" data-text=\"iPhone Programming Tutorial: Creating An Image Gallery Like Over - Part 2\" data-url=\"http://brandontreb.com/iphone-programming-tutorial-creating-an-image-gallery-like-over-part-2\" data-via=\"brandontreb\" data-related=\"brandontreb:\">Tweet</a>\n</div>\n\n",
			"date_published": "2013-08-15T00:00:00-06:00",
			"url": "http://localhost:4000/iphone-programming-tutorial-creating-an-image-gallery-like-over-part-2"
		},
		
		{
			"id": "iphone-programming-tutorial-creating-an-image-gallery-like-over-part-1",
      
			"title": "iPhone Programming Tutorial: Creating An Image Gallery Like Over &#8211; Part 1",
			
			"content_html": "<p><a href=\"http://brandontreb.com/wp-content/uploads/2013/08/Screen-Shot-2013-08-09-at-8.36.42-PM.png\"><img class=\"alignright\" alt=\"Screen Shot 2013-08-09 at 8.36.42 PM\" src=\"http://brandontreb.com/wp-content/uploads/2013/08/Screen-Shot-2013-08-09-at-8.36.42-PM.png\" width=\"225\" height=\"365\" /></a></p>\n\n<p> </p>\n\n<p>Recently, I have had to build an app (<a href=\"http://j.mp/scriptapp\" target=\"_blank\">download link</a>) that required the user to choose a photo from their photo library.  Rather than just throwing up a <strong>UIImagePickerController</strong> like many apps, I decided to add a little bit of style.  Being inspired by Over’s ultra simplistic (and beautiful) photo selection interface, I decided to fancy things up a bit.</p>\n\n<p>For this tutorial, I will start with a Fresh <strong>iOS6</strong> View-Based application that uses <strong>Storyboards</strong> and <strong>ARC</strong>. Also note that I will be optimizing for the iPhone 5 resolution.  You are free to make the tweaks necessary to deploy on the iPhone 4 and 4S.</p>\n\n<p> </p>\n\n<p>Here is a breakdown of what we will cover in this part:</p>\n\n<ol>\n  <li><span style=\"line-height: 14px;\">Creating a <strong>UICollectionView </strong>inside of <strong>Storyboard</strong></span></li>\n  <li>Using the <strong>ALAssetsLibrary</strong> to fetch photos from the user’s <strong>Camera Roll</strong></li>\n  <li>Displaying the <strong>ALAssets</strong> inside of the <strong>UICollectionView</strong></li>\n</ol>\n\n<h3 id=\"1-preparing-the-iboutlets\">1. Preparing The IBOutlets</h3>\n\n<p>Start by opening up <strong>ViewController.m **and replacing the **@interface</strong> declaration at the top with the following code:</p>\n\n<div class=\"wp_syntax\">\n  <table>\n    <tr>\n      <td class=\"code\">\n        <pre class=\"objc\" style=\"font-family:monospace;\"><span style=\"color: #a61390;\">@interface</span> ViewController <span style=\"color: #002200;\">&#40;</span><span style=\"color: #002200;\">&#41;</span>&lt;UICollectionViewDataSource, UICollectionViewDelegate, UICollectionViewDelegateFlowLayout&gt;\n<span style=\"color: #a61390;\">@property</span><span style=\"color: #002200;\">&#40;</span>nonatomic, weak<span style=\"color: #002200;\">&#41;</span> IBOutlet UICollectionView <span style=\"color: #002200;\">*</span>collectionView;\n<span style=\"color: #a61390;\">@end</span></pre>\n      </td>\n    </tr>\n  </table>\n</div>\n\n<p>This will declare the <strong>IBOutlet </strong>needed to hook up the main <strong>UICollectionView</strong> that we will be using to display the user’s photos.  I have also set up our class to be a <strong>UICollectionViewDataSource</strong>, <strong>UICollectionViewDelegate</strong>, and <strong>UICollectionViewDelegateFlowLayout</strong>. This is necessary when interfacing with the <strong>UICollectionView.</strong></p>\n\n<h3 id=\"2-setting-up-the-uicollectionview-in-storyboard\">2. Setting Up The UICollectionView In Storyboard</h3>\n\n<p>Open up <strong>MainStoryboard.storyboard </strong>and drag a <strong>UICollectionView</strong> on to your view ensuring that it stretches the entire screen.</p>\n\n<p><a href=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-21-at-8.44.02-PM.png\"><img class=\"alignnone size-medium wp-image-210\" alt=\"Screen Shot 2013-07-21 at 8.44.02 PM\" src=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-21-at-8.44.02-PM-172x300.png\" width=\"172\" height=\"300\" /></a></p>\n\n<p>Then, <strong>Control-Click</strong> and drag from the <strong>UICollectionView </strong>to your <strong>ViewController </strong>Object and set it as the <strong>delegate </strong>and <strong>datasource.</strong></p>\n\n<p><a href=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-21-at-8.41.29-PM.png\"><img class=\"alignnone size-full wp-image-209\" alt=\"Screen Shot 2013-07-21 at 8.41.29 PM\" src=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-21-at-8.41.29-PM.png\" width=\"265\" height=\"181\" /></a></p>\n\n<p>Finally, <strong>Control-Click </strong>and drag from <strong>View Controller </strong>to <strong>Collection View</strong> and selected <strong>collectionView </strong>to make the <strong>IBOutlet </strong>connection.</p>\n\n<p><a href=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-21-at-8.45.05-PM.png\"><img class=\"alignnone size-full wp-image-211\" alt=\"Screen Shot 2013-07-21 at 8.45.05 PM\" src=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-21-at-8.45.05-PM.png\" width=\"267\" height=\"148\" /></a></p>\n\n<p>Now, we need to give a <strong>Cell Identifier</strong> to the <strong>UICollectionViewCell</strong> so that we can reference it in code.  Click on the default cell inside of the <strong>UICollectionView</strong> and open the <strong>Attributes Inspector. </strong>For the <strong>Identifier</strong> type in <strong>PhotoCell.</strong> The cell might be a little tricky to see as its background color is clear, but it’s there. Simply click in the top left corner of the <strong>UICollectionView</strong>.</p>\n\n<p><a href=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-21-at-9.13.08-PM.png\"><img class=\"alignnone size-medium wp-image-219\" alt=\"Screen Shot 2013-07-21 at 9.13.08 PM\" src=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-21-at-9.13.08-PM-300x67.png\" width=\"300\" height=\"67\" /></a></p>\n\n<p>Now that the <strong>UICollectionView</strong> has been set up, it’s time to fetch the photos from the user’s photo library.</p>\n\n<pre style=\"background-color: #eee; border: 1px solid #444444;\">If you are using the simulator, make sure to populate the Photo Gallery with images from the web. Simply open up a browser, do a Google Image Search, and click and hold on various images. You should have an option from the menu that pops up to save the images to your camera roll.\n\nFinally, open up the <b>Photos</b> app on the simulator to initialize the Assets Library.</pre>\n\n<h3 id=\"3-fetching-alassets-user-photos-from-the-alassets-library\">3. Fetching ALAssets (user photos) From The ALAssets Library</h3>\n\n<p>In order to interface with the user’s photo library, we must first import the <strong>AssetsLibrary.framework </strong>framework.  To do this, click on your project in the sidebar, select the Target, then click <strong>Build Phases, </strong>expand the <strong>Link Binary With Libraries</strong> section and click the <strong>+ </strong>button.  Do a search for <strong>Assset </strong>and then double click on <strong>AssetsLibrary.framework.</strong></p>\n\n<p><a href=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-21-at-8.57.37-PM.png\"><img class=\"alignnone size-medium wp-image-216\" alt=\"Screen Shot 2013-07-21 at 8.57.37 PM\" src=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-21-at-8.57.37-PM-259x300.png\" width=\"259\" height=\"300\" /></a></p>\n\n<p>It should now be added to your project and ready to use.  Now that it has been linked, we must import it into the <strong>ViewController.m </strong>file.  Open up <strong>ViewController.m </strong>and add the following import to the top of the file:</p>\n\n<div class=\"wp_syntax\">\n  <table>\n    <tr>\n      <td class=\"code\">\n        <pre class=\"objc\" style=\"font-family:monospace;\"><span style=\"color: #6e371a;\">#import &lt;AssetsLibrary/AssetsLibrary.h&gt;</span></pre>\n      </td>\n    </tr>\n  </table>\n</div>\n\n<p>Before we can fetch the user’s photos, we need to set up an <strong>NSArray</strong> to put them in.  Add the following line within the <strong>@interface </strong>declaration at the top.</p>\n\n<div class=\"wp_syntax\">\n  <table>\n    <tr>\n      <td class=\"code\">\n        <pre class=\"objc\" style=\"font-family:monospace;\"><span style=\"color: #a61390;\">@property</span><span style=\"color: #002200;\">&#40;</span>nonatomic, strong<span style=\"color: #002200;\">&#41;</span> <span style=\"color: #400080;\">NSArray</span> <span style=\"color: #002200;\">*</span>assets;</pre>\n      </td>\n    </tr>\n  </table>\n</div>\n\n<p>Now, add the following method to your class:</p>\n\n<div class=\"wp_syntax\">\n  <table>\n    <tr>\n      <td class=\"code\">\n        <pre class=\"objc\" style=\"font-family:monospace;\"><span style=\"color: #002200;\">+</span> <span style=\"color: #002200;\">&#40;</span>ALAssetsLibrary <span style=\"color: #002200;\">*</span><span style=\"color: #002200;\">&#41;</span>defaultAssetsLibrary\n<span style=\"color: #002200;\">&#123;</span>\n    <span style=\"color: #a61390;\">static</span> dispatch_once_t pred <span style=\"color: #002200;\">=</span> <span style=\"color: #2400d9;\"></span>;\n    <span style=\"color: #a61390;\">static</span> ALAssetsLibrary <span style=\"color: #002200;\">*</span>library <span style=\"color: #002200;\">=</span> <span style=\"color: #a61390;\">nil</span>;\n    dispatch_once<span style=\"color: #002200;\">&#40;</span><span style=\"color: #002200;\">&amp;</span>pred, <span style=\"color: #002200;\">^</span><span style=\"color: #002200;\">&#123;</span>\n        library <span style=\"color: #002200;\">=</span> <span style=\"color: #002200;\">&#91;</span><span style=\"color: #002200;\">&#91;</span>ALAssetsLibrary alloc<span style=\"color: #002200;\">&#93;</span> init<span style=\"color: #002200;\">&#93;</span>;\n    <span style=\"color: #002200;\">&#125;</span><span style=\"color: #002200;\">&#41;</span>;\n    <span style=\"color: #a61390;\">return</span> library;\n<span style=\"color: #002200;\">&#125;</span></pre>\n      </td>\n    </tr>\n  </table>\n</div>\n\n<p>This is a static method that creates a static instance to the <strong>ALAssetsLibrary</strong>.  The reason this is needed is, when we enumerate the <strong>ALAssets</strong> in the next method, it seems that the assets get released immediately and otherwise wouldn’t be able to be used in the rest of the application. I will explain this a little more in a moment.</p>\n\n<p>Head over to <strong>viewDidLoad</strong> and add the following code:</p>\n\n<div class=\"wp_syntax\">\n  <table>\n    <tr>\n      <td class=\"code\">\n        <pre class=\"objc\" style=\"font-family:monospace;\"><span style=\"color: #002200;\">-</span> <span style=\"color: #002200;\">&#40;</span><span style=\"color: #a61390;\">void</span><span style=\"color: #002200;\">&#41;</span>viewDidLoad\n<span style=\"color: #002200;\">&#123;</span>\n    <span style=\"color: #002200;\">&#91;</span>super viewDidLoad<span style=\"color: #002200;\">&#93;</span>;\n&nbsp;\n    _assets <span style=\"color: #002200;\">=</span> <span style=\"color: #002200;\">&#91;</span>@<span style=\"color: #002200;\">&#91;</span><span style=\"color: #002200;\">&#93;</span> mutableCopy<span style=\"color: #002200;\">&#93;</span>;\n    __block <span style=\"color: #400080;\">NSMutableArray</span> <span style=\"color: #002200;\">*</span>tmpAssets <span style=\"color: #002200;\">=</span> <span style=\"color: #002200;\">&#91;</span>@<span style=\"color: #002200;\">&#91;</span><span style=\"color: #002200;\">&#93;</span> mutableCopy<span style=\"color: #002200;\">&#93;</span>;\n    <span style=\"color: #11740a; font-style: italic;\">// 1</span>\n    ALAssetsLibrary <span style=\"color: #002200;\">*</span>assetsLibrary <span style=\"color: #002200;\">=</span> <span style=\"color: #002200;\">&#91;</span>ViewController defaultAssetsLibrary<span style=\"color: #002200;\">&#93;</span>;\n    <span style=\"color: #11740a; font-style: italic;\">// 2</span>\n    <span style=\"color: #002200;\">&#91;</span>assetsLibrary enumerateGroupsWithTypes<span style=\"color: #002200;\">:</span>ALAssetsGroupAll usingBlock<span style=\"color: #002200;\">:^</span><span style=\"color: #002200;\">&#40;</span>ALAssetsGroup <span style=\"color: #002200;\">*</span>group, <span style=\"color: #a61390;\">BOOL</span> <span style=\"color: #002200;\">*</span>stop<span style=\"color: #002200;\">&#41;</span> <span style=\"color: #002200;\">&#123;</span>\n        <span style=\"color: #002200;\">&#91;</span>group enumerateAssetsUsingBlock<span style=\"color: #002200;\">:^</span><span style=\"color: #002200;\">&#40;</span>ALAsset <span style=\"color: #002200;\">*</span>result, NSUInteger index, <span style=\"color: #a61390;\">BOOL</span> <span style=\"color: #002200;\">*</span>stop<span style=\"color: #002200;\">&#41;</span> <span style=\"color: #002200;\">&#123;</span>\n            <span style=\"color: #a61390;\">if</span><span style=\"color: #002200;\">&#40;</span>result<span style=\"color: #002200;\">&#41;</span>\n            <span style=\"color: #002200;\">&#123;</span>\n                <span style=\"color: #11740a; font-style: italic;\">// 3</span>\n                <span style=\"color: #002200;\">&#91;</span>tmpAssets addObject<span style=\"color: #002200;\">:</span>result<span style=\"color: #002200;\">&#93;</span>;\n            <span style=\"color: #002200;\">&#125;</span>\n        <span style=\"color: #002200;\">&#125;</span><span style=\"color: #002200;\">&#93;</span>;\n&nbsp;\n        <span style=\"color: #11740a; font-style: italic;\">// 4</span>\n        <span style=\"color: #11740a; font-style: italic;\">//NSSortDescriptor *sort = [NSSortDescriptor sortDescriptorWithKey:@\"date\" ascending:NO];</span>\n        <span style=\"color: #11740a; font-style: italic;\">//self.assets = [tmpAssets sortedArrayUsingDescriptors:@[sort]];</span>\n        self.assets <span style=\"color: #002200;\">=</span> tmpAssets;\n&nbsp;\n        <span style=\"color: #11740a; font-style: italic;\">// 5</span>\n        <span style=\"color: #002200;\">&#91;</span>self.collectionView reloadData<span style=\"color: #002200;\">&#93;</span>;\n    <span style=\"color: #002200;\">&#125;</span> failureBlock<span style=\"color: #002200;\">:^</span><span style=\"color: #002200;\">&#40;</span><span style=\"color: #400080;\">NSError</span> <span style=\"color: #002200;\">*</span>error<span style=\"color: #002200;\">&#41;</span> <span style=\"color: #002200;\">&#123;</span>\n        NSLog<span style=\"color: #002200;\">&#40;</span><span style=\"color: #bf1d1a;\">@</span><span style=\"color: #bf1d1a;\">\"Error loading images %@\"</span>, error<span style=\"color: #002200;\">&#41;</span>;\n    <span style=\"color: #002200;\">&#125;</span><span style=\"color: #002200;\">&#93;</span>;\n<span style=\"color: #002200;\">&#125;</span></pre>\n      </td>\n    </tr>\n  </table>\n</div>\n\n<ol>\n  <li>Grab our static instance of the <strong>ALAssetsLibrary</strong></li>\n  <li>Enumerate through all of the <strong>ALAssets </strong>(photos) in the user’s <strong>Asset Groups</strong> (Folders)</li>\n  <li>Enumerate each folder and add it’s <strong>ALAssets </strong>to the temporary array</li>\n  <li>Sort the assets list by date (this won’t work yet, but I will show you how to fix later). For now this code is commented out and the Assets will be sorted however they come out.</li>\n  <li>Reload the <strong>UICollectionView</strong> (this won’t work yet as we haven’t set up the delegate methods)</li>\n</ol>\n\n<p>Now that we have an <strong>NSArray</strong> populated with <strong>ALAssets</strong>, let’s set up the <strong>delegate </strong>methods for the <strong>UICollectionView</strong> in order to populate it with data.</p>\n\n<h3 id=\"4-populating-the-uicollectionview-with-data\">4. Populating the UICollectionView With Data</h3>\n\n<p>A <strong>UICollectionView</strong> functions much like a <strong>UITableView </strong>having delegate and datasource methods.  Add the following methods to your <strong>ViewController</strong> class to populate the view.</p>\n\n<div class=\"wp_syntax\">\n  <table>\n    <tr>\n      <td class=\"code\">\n        <pre class=\"objc\" style=\"font-family:monospace;\"><span style=\"color: #6e371a;\">#pragma mark - collection view data source</span>\n&nbsp;\n<span style=\"color: #002200;\">-</span> <span style=\"color: #002200;\">&#40;</span>NSInteger<span style=\"color: #002200;\">&#41;</span> collectionView<span style=\"color: #002200;\">:</span><span style=\"color: #002200;\">&#40;</span>UICollectionView <span style=\"color: #002200;\">*</span><span style=\"color: #002200;\">&#41;</span>collectionView numberOfItemsInSection<span style=\"color: #002200;\">:</span><span style=\"color: #002200;\">&#40;</span>NSInteger<span style=\"color: #002200;\">&#41;</span>section\n<span style=\"color: #002200;\">&#123;</span>\n    <span style=\"color: #a61390;\">return</span> self.assets.count;\n<span style=\"color: #002200;\">&#125;</span>\n&nbsp;\n<span style=\"color: #002200;\">-</span> <span style=\"color: #002200;\">&#40;</span>UICollectionViewCell <span style=\"color: #002200;\">*</span><span style=\"color: #002200;\">&#41;</span> collectionView<span style=\"color: #002200;\">:</span><span style=\"color: #002200;\">&#40;</span>UICollectionView <span style=\"color: #002200;\">*</span><span style=\"color: #002200;\">&#41;</span>collectionView cellForItemAtIndexPath<span style=\"color: #002200;\">:</span><span style=\"color: #002200;\">&#40;</span><span style=\"color: #400080;\">NSIndexPath</span> <span style=\"color: #002200;\">*</span><span style=\"color: #002200;\">&#41;</span>indexPath\n<span style=\"color: #002200;\">&#123;</span>\n    UICollectionViewCell <span style=\"color: #002200;\">*</span>cell <span style=\"color: #002200;\">=</span> <span style=\"color: #002200;\">&#40;</span>UICollectionViewCell <span style=\"color: #002200;\">*</span><span style=\"color: #002200;\">&#41;</span><span style=\"color: #002200;\">&#91;</span>collectionView dequeueReusableCellWithReuseIdentifier<span style=\"color: #002200;\">:</span><span style=\"color: #bf1d1a;\">@</span><span style=\"color: #bf1d1a;\">\"PhotoCell\"</span> forIndexPath<span style=\"color: #002200;\">:</span>indexPath<span style=\"color: #002200;\">&#93;</span>;\n&nbsp;\n    ALAsset <span style=\"color: #002200;\">*</span>asset <span style=\"color: #002200;\">=</span> self.assets<span style=\"color: #002200;\">&#91;</span>indexPath.row<span style=\"color: #002200;\">&#93;</span>;\n    <span style=\"color: #11740a; font-style: italic;\">//cell.asset = asset;</span>\n    cell.backgroundColor <span style=\"color: #002200;\">=</span> <span style=\"color: #002200;\">&#91;</span>UIColor redColor<span style=\"color: #002200;\">&#93;</span>;\n&nbsp;\n    <span style=\"color: #a61390;\">return</span> cell;\n<span style=\"color: #002200;\">&#125;</span>\n&nbsp;\n<span style=\"color: #002200;\">-</span> <span style=\"color: #002200;\">&#40;</span>CGFloat<span style=\"color: #002200;\">&#41;</span> collectionView<span style=\"color: #002200;\">:</span><span style=\"color: #002200;\">&#40;</span>UICollectionView <span style=\"color: #002200;\">*</span><span style=\"color: #002200;\">&#41;</span>collectionView layout<span style=\"color: #002200;\">:</span><span style=\"color: #002200;\">&#40;</span>UICollectionViewLayout <span style=\"color: #002200;\">*</span><span style=\"color: #002200;\">&#41;</span>collectionViewLayout minimumLineSpacingForSectionAtIndex<span style=\"color: #002200;\">:</span><span style=\"color: #002200;\">&#40;</span>NSInteger<span style=\"color: #002200;\">&#41;</span>section\n<span style=\"color: #002200;\">&#123;</span>\n    <span style=\"color: #a61390;\">return</span> <span style=\"color: #2400d9;\">4</span>;\n<span style=\"color: #002200;\">&#125;</span>\n&nbsp;\n<span style=\"color: #002200;\">-</span> <span style=\"color: #002200;\">&#40;</span>CGFloat<span style=\"color: #002200;\">&#41;</span> collectionView<span style=\"color: #002200;\">:</span><span style=\"color: #002200;\">&#40;</span>UICollectionView <span style=\"color: #002200;\">*</span><span style=\"color: #002200;\">&#41;</span>collectionView layout<span style=\"color: #002200;\">:</span><span style=\"color: #002200;\">&#40;</span>UICollectionViewLayout <span style=\"color: #002200;\">*</span><span style=\"color: #002200;\">&#41;</span>collectionViewLayout minimumInteritemSpacingForSectionAtIndex<span style=\"color: #002200;\">:</span><span style=\"color: #002200;\">&#40;</span>NSInteger<span style=\"color: #002200;\">&#41;</span>section\n<span style=\"color: #002200;\">&#123;</span>\n    <span style=\"color: #a61390;\">return</span> <span style=\"color: #2400d9;\">1</span>;\n<span style=\"color: #002200;\">&#125;</span></pre>\n      </td>\n    </tr>\n  </table>\n</div>\n\n<p>This code should be fairly straight forward if you have ever worked with a <strong>UITableView.</strong>  The only lines to note are where ‘cell.asset = asset’ is commented out and we set the cell’s background color to red.  We will uncomment that line when we create a custom cell to display the image (for now it won’t).  I have also set the background color to red so that you can see that the number of cells is actually corresponding to the number of photos in the camera roll.</p>\n\n<p><strong>Build and Run!</strong></p>\n\n<p>Let’s take a break to do a build and run to see what happens.  If you have hooked everything up correctly, you should see a black screen with red squares on it with a count equalling the number of photos in the user’s library.</p>\n\n<p><a href=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-21-at-9.26.07-PM.png\"><img class=\"alignnone size-medium wp-image-225\" alt=\"Screen Shot 2013-07-21 at 9.26.07 PM\" src=\"http://brandontreb.com/wp-content/uploads/2013/07/Screen-Shot-2013-07-21-at-9.26.07-PM-184x300.png\" width=\"184\" height=\"300\" /></a></p>\n\n<p>Not too exciting, however it shows that we are displaying a number of cells corresponding to the number of photos in the user’s asset library.  At least it’s showing that you have done something.  The next step is to create a custom <strong>UICollectionViewCell</strong> that actually displays the photos, which we will do next time.</p>\n\n<h3 id=\"5-next-time\">5. Next Time</h3>\n\n<p>That’s all for today.  In a ploy to get you to come back to my site (and<a href=\"http://feeds.feedburner.com/brandontreb\"> subscribe to my RSS feed</a>), I have chosen to break this post up into two parts.  </p>\n\n<p>Luckily for you, I wrote the above message a while ago. Click the link below to go to part 2!</p>\n\n<p><a href=\"http://brandontreb.com/iphone-programming-tutorial-creating-an-image-gallery-like-over-part-2\">iPhone Programming Tutorial: Creating An Image Gallery Like Over – Part 2</a></p>\n\n<p>Stay tuned!</p>\n\n<div style=\"\">\n  <a href=\"http://twitter.com/share\" class=\"twitter-share-button\" data-count=\"horizontal\" data-text=\"iPhone Programming Tutorial: Creating An Image Gallery Like Over - Part 1\" data-url=\"http://brandontreb.com/iphone-programming-tutorial-creating-an-image-gallery-like-over-part-1\" data-via=\"brandontreb\" data-related=\"brandontreb:\">Tweet</a>\n</div>\n\n",
			"date_published": "2013-08-12T00:00:00-06:00",
			"url": "http://localhost:4000/iphone-programming-tutorial-creating-an-image-gallery-like-over-part-1"
		},
		
		{
			"id": "back-to-my-roots",
      
			"title": "Back To My Roots",
			
			"content_html": "<p>I wrote my very first blog post back in <a href=\"http://www.icodeblog.com/2008/07/22/icodeblog-launched/\">July of 2008</a> when I start iCodeBlog.com.  I started the blog because I saw a huge need for iOS development tutorials on the web and really wanted to help others as I progressed in my development.</p>\n\n<p>Well, quite a bit has changed since then.  I have written books, spoken at conferences, and built and shipped over 40 iOS applications.  Since selling iCodeblog in 2009, I have really let my passion for blogging fizzle.  For the first 2 years of the iCode sale, I wasn’t allowed to write tutorials on any other site.  This was very discouraging.</p>\n\n<p>Over the years, I have guest blogged iOS tutorials on several sites including <a href=\"http://mobile.tutsplus.com/author/brandon-trebitowski/\">mobile.tutsplus.com</a> and <a href=\"http://www.raywenderlich.com/author/brandontreb\">raywenderlich.com</a>.  This has been pretty hit or miss for me.</p>\n\n<p>As of recent, I have become an <a href=\"http://brandontreb.com/what-i-learned-in-my-first-month-being-a-contract-ios-developer\">independent iOS developer</a> and have been solving quite a few hard problems and coming up with some interesting solutions on projects that I have been a part of.  I now want to share some of those solutions with the iOS community in the form of tutorial blog posts.  These come in all shapes in sizes from cool UIKit hacks to building simple backend services.</p>\n\n<p>So, when I say that I want to “get back to my roots”, I really want to start consistently blogging again and educating other developers using the knowledge I have gained over the years.  So stick around, <a href=\"http://brandontreb.com/feed\">subscribe</a>,<a href=\"http://twitter.com/brandontreb\"> follow me</a>, and please don’t hesitate to suggest tutorial ideas.</p>\n\n<p>Happy hacking…</p>\n\n<div style=\"\">\n  <a href=\"http://twitter.com/share\" class=\"twitter-share-button\" data-count=\"horizontal\" data-text=\"Back To My Roots\" data-url=\"http://brandontreb.com/back-to-my-roots\" data-via=\"brandontreb\" data-related=\"brandontreb:\">Tweet</a>\n</div>\n\n",
			"date_published": "2013-06-12T00:00:00-06:00",
			"url": "http://localhost:4000/back-to-my-roots"
		},
		
		{
			"id": "tools-of-the-trade-what-tools-i-use-for-ios-consulting",
      
			"title": "Tools of The Trade: What Tools I Use For iOS Consulting",
			
			"content_html": "<p><strong>Welcome Hacker News!</strong> There’s some discussion happening in the comments; but, as always, the better conversation is on the <a href=\"http://news.ycombinator.com/item?id=5128793\">article page</a> on Hacker News itself.</p>\n\n<p>Since going Indie, I am constantly asked about what software tools I use to facilitate the process. People are always curious about invoicing, time tracking, ticket management, etc…</p>\n\n<p>The purpose of this post is two fold. First, I want to educate others on some of the cool tools I have found that have helped me out tremndously. The other is, I would hope that veterans in the space could give their two cents as to some better tools (or better use of the current one’s). Either way, I’d love to hear from you.</p>\n\n<h2 id=\"1-tools-for-finding-contracts\">1. Tools For Finding Contracts</h2>\n\n<p>This is perhaps the area where I am most asked about. Well, the secret is, looking for contracts isn’t that much different than looking for a job. You just need to know what to look for. Here are the few major sources where I have found sucess in finding good contracts.</p>\n\n<ul>\n  <li><a href=\"http://www.linkedin.com/jobs?displayHome=\">Linked In Jobs</a> I love Linked In. I have found it to be <strong>the most</strong> valuable tool for job searches and connecting to date. I love that it will suggest jobs/contracts to you based on your profile and experience. Another great thing about Linked In is contract search can become passive if you are actively connecting and posting. Once your name starts flowing out there (assuming you have the exp), people will just start offering you contracts.</li>\n  <li><a href=\"http://www.authenticjobs.com\">Authentic Jobs</a> I like this site a lot. Their interface is much cleaner than some of the other job search sites and while they had fewer contracts available, they were generally of a higher quality. In fact, I found the current contract that I’m working on here.</li>\n  <li><a href=\"http://www.simplyhired.com/\">Simply Hired</a> Although this site generally offlinks to other sites, I found it to be a good aggrigator of what’s out there.</li>\n  <li><a href=\"http://google.com\">Good Ol Google</a> This seems like a job, but as I mentioned in my <a href=\"http://brandontreb.com/what-i-learned-in-my-first-month-being-a-contract-ios-developer/\">last post</a>, it’s pretty easy to type “[:field_name] contract work” and come up with a pretty good list.</li>\n</ul>\n\n<h2 id=\"2-tools-for-managing-clientsbilling\">2. Tools For Managing Clients/Billing</h2>\n\n<p>As a new contractor, the concept of billing can seem a bit scary. You don’t want to look like a n00b, but you also don’t want to spend a lot of money. That’s where <a href=\"https://brandontrebitowski.freshbooks.com/refer/www\">FreshBooks</a> comes in.</p>\n\n<p>I started using FreshBooks from day one and could not be happier with their service. Here are some of the pros:</p>\n\n<ul>\n  <li>Free for up to 3 clients. It says 30 day trial, but that’s just if you want more than 3 clients. So it’s perfect for when you are starting out.</li>\n  <li>Manage multiple projects for mulitiple clients with multiple tasks (‘nuff said)</li>\n  <li>Mobile app. You haven’t lived until you have sent an invoice from your smartphone. You feel super businessy. For an added bonus, send it from the gym, or your sailboat.</li>\n  <li>It handles sending invoices via mail or email automatically and reports back to you when the client has seen the invoice.</li>\n</ul>\n\n<p>Again, <a href=\"https://brandontrebitowski.freshbooks.com/refer/www\">FreshBooks</a> is awesome! I can’t recommend it enough.</p>\n\n<h2 id=\"3-tools-for-ticket-management\">3. Tools For Ticket Management</h2>\n\n<p>This one is tricky, because every client is going to want to work differently. Here are the few I have expereinced thus far.</p>\n\n<ul>\n  <li><a href=\"https://www.pivotaltracker.com\">Pivotal Tracker</a> This one is my favorite. It’s a very easy to use tool to help facilitate development in an agile environment. Even if you are not running the full scrum process, it’s still a valuable tool to simply track your progress. Your clients will appreciate it.</li>\n  <li><a href=\"http://basecamp.com\">Basecamp</a> You knew I was going to say this one. It’s an obvious choice because it’s obvioulsy a solid tool. I think it’s very valuable when you have a distributed team and need a central way to communicate.</li>\n</ul>\n\n<p>Even if your client doesn’t use a tracker, I’d suggest you use one. It helps you to keep organized and get a better feel for how long certain tasks take (which you will need to know in future scoping).</p>\n\n<p>I dont’ have a very long list here because I hate most tracking software. If you have some to add here, I would love to hear about them in the comments.</p>\n\n<h2 id=\"4-tools-for-software-development\">4. Tools For Software Development</h2>\n\n<p>I am an iOS and rails developer, so this section may or may not be applicable to you. Again, I put this out there to let you know what <strong>I</strong> am using and would love to hear what <strong>you</strong> are using.</p>\n\n<p><strong>iOS</strong></p>\n\n<ul>\n  <li>XCode (duh)</li>\n  <li><a href=\"http://cocoapods.org\">CocoaPods</a> – If you don’t use CocoaPods, you are doing it wrong. They are what gems are to rails and really help you manage 3rd party libraries.</li>\n  <li><a href=\"http://github.com\">GitHub</a> – For verison control and code distribution amoung the team. (again, you know this already).</li>\n</ul>\n\n<p><strong>Rails</strong></p>\n\n<ul>\n  <li><a href=\"http://www.sublimetext.com\">Sublime Text</a> I was big on TextMate for a while, but now I use Sublime Text full time. It has some solid plugins and can do a smart autocomplete for any file type.</li>\n  <li><a href=\"http://www.heroku.com\">Heroku</a> Deploying rails to production sucks. Heroku makes this process easy.</li>\n</ul>\n\n<h2 id=\"5-tools-for-communication\">5. Tools For Communication</h2>\n\n<p>Working in a distributed team can be hard at first. Especially staying connected. Here are the major forms of communication that I use.</p>\n\n<ul>\n  <li><a href=\"http://beta.skype.com/en/\">Skype</a> Although Skype has totally gone down hill since the MS takeover, it’s still a free service that <em>most</em> clients will use. I’d suggest if you don’t have a Skype account, you get one before job searching.</li>\n  <li><a href=\"https://www.google.com/voice/b/0?pli=1\">Google Voice</a> This service allows you to forward a number directly on your cell phone. It also has some nicities like screening your calls, voicemail, free calls, etc… It’s good to give out your Google voice number instead of your cell to clients as well as possible girl/boyfriends in case things go sour.</li>\n  <li><a href=\"http://www.google.com/+/learnmore/hangouts/\">Google Hangout</a> Skype falls short in one area (which happens to be their business model). If you have more than 2 people on a call, they must all have a premium account to do video chat or screenshare. Google Hangout gives you all of these features for free with up to 10 people as of this writing.</li>\n  <li>Standard social networks (Twitter, Linked In, G+) (duh)</li>\n</ul>\n\n<h2 id=\"conclusion\">Conclusion</h2>\n\n<p>Well, this post is already getting a bit out of control. I could go on and on. If I have obviously omitted a large section, please feel free to troll me in the comments and I will certainly add it.</p>\n\n<p>I hope this has been able to provide you with some value, and I would love to hear your thoughts.</p>\n\n<div style=\"\">\n  <a href=\"http://twitter.com/share\" class=\"twitter-share-button\" data-count=\"horizontal\" data-text=\"Tools of The Trade: What Tools I Use For iOS Consulting\" data-url=\"http://brandontreb.com/tools-of-the-trade-what-tools-i-use-for-ios-consulting\" data-via=\"brandontreb\" data-related=\"brandontreb:\">Tweet</a>\n</div>\n\n",
			"date_published": "2013-01-22T00:00:00-07:00",
			"url": "http://localhost:4000/tools-of-the-trade-what-tools-i-use-for-ios-consulting"
		}
		
	]
}
